{
    "ANTH 200": {
        "200810": {
            "001": {
                "Term": "Spring Semester 2008",
                "CRN": "(21107)",
                "Reviews": [
                    "I want to major in Linguistics, and I knew that before I even took this class, but unfortunately this class is a pre-requisite to a lot of the required courses of the major. The class was large lecture hall, so attendance was not taken. Although the lectures supplemented the reading material, it was kind of easy to just learn from the book and read the powerpoints (that he would post online) later on. If I did not find this material interesting, this class would have been boring to me. If you only want to take this course as an easy D2 requirement, I would recommend looking elsewhere.",
                    "My only gripe was the weighting of assignments towards the final grade. Other than that, the course was fairly good.",
                    "good instructor, good lectures",
                    "I had pretty much learned everything taught in this class on my own, but I feel that this class would be an excellent introduction to linguistics. The course project, where you conduct field research on a specific topic, was especially enjoyable.",
                    "The course was for the most part very interesting, and the layout of the material made it extremely easy to manage even relatively long homework assignments. That said, there were a few longer assignments, and one in particular that seemed more tedious than important as we transcribed natural speech. Tests fairly reflected the material and homework and the book was an easy and interesting read.",
                    "I suppose it helps a bit that I was already interested in linguistics, but I liked the way the class was structured around each of the different branches of linguistics.",
                    "The material is interesting and in a field with which few students will have prior experience. It is well-presented and clearly explained.",
                    "This course was a light and interesting introduction to the field of linguistics and my eyes were opened to the incredible complexity and subtlety of language and all its facents.",
                    "Its alot of work but its interesting",
                    "This was an interesting class that I didnt really have time for. I learned out of the book and from the online notes, and what I read was interesting",
                    "It's a fine course with enough information to keep you interested, it just isn't challenging enough to be a \"great\" class",
                    "I took this course because of the advice of a friend but wasn't really into it. It was interesting material just not stuff I found all that exciting.",
                    "There was a lot of interesting material in this course. I'd never really had much interest in linguistics, but took it on the urging of a friend and actually thought it was really good. I wasn't crazy about the group project for the sole reason of it being so difficult in such a large class to organize something, but otherwise most of the material covered was great and provided a kind of sampler of the different facets of linguistics. I didn't feel like anything got cheated out of time either, the time spent on each section was just perfect.",
                    "A few of the questions on the homeworks were a bit vague, but nothing particularly serious.",
                    "The course covered a good variety of topics and is what you'd expect from an intro class.",
                    "Interesting stuff, I took this class because a friend recommended it, and had a different professor and learned completely different things than were taught the semester before. A lot of variance depending on the professor.",
                    "The homework was too much for me.",
                    "This was a very interesting course and probably one of the D2s that I really enjoyed taking. There was adequate material covered over the semester with sufficient time to cover it. I would recommend this course to a fellow classmate.",
                    "This course was well designed and gave a good introduction to the study of language.",
                    "I enjoyed some of the material in the class, but i thought that critical thinking skills were not emphasized at all, and alot of memorization was required. Therefore I found class boring sometimes.",
                    "The course was efficiently taught, and I learned a lot of basics about the study of linguistics. It gave me a good idea of what future courses will be like if i choose to pursue this area of interest.",
                    "This course was very a very extensive introduction the study of linguistics. At times it was interesting, but at other times I thought it was a bit boring and common sense. I certainly enjoyed the end where we learned about the different dialects in America.",
                    "A good introduction to linguistics, but not necessarily the most interesting of classes.",
                    "The class was organized but the material was not presented in the best way.",
                    "The course material was very interesting to me, especially the phonetics and phonology sections. However, the lectures were more or less unnecessary as the powerpoints were posted on the website and one could simply study off of that. The readings were also a bit pointless seeing that one could get a good grade without actually reading anything.",
                    "Interesting but could have been more active",
                    "really interesting, but also easy class. assignments were actually enjoyable.",
                    "The course covers a broad range of LING topics, all of which are fascinating on an academic level and also directly and immediately observable/applicable in everyday life and relationships. This is a must-take for anyone interested in language, psychology, or human interaction in general.",
                    "The material was easy to understand, the topics were interesting and ones I had never come in contact with (being an engineer). I would definitely recommend it to anyone looking for a good distribution credit.",
                    "The material in this course is relatively basic but comprehensive. As long as you put some effort into it, nothing is really too hard to understand.",
                    "I enjoyed the content which took us through a a scientific introduction to the subject ending with the social effects that it has. Material was interesting for the most part, and homeworks were actually fun to do - they take principles discussed and apply them but in a very playful, quizzing type manner, that does in fact help you learn it.",
                    "Great course- easy to follow and interesting material.",
                    "I enjoyed this class. The workload was relatively lighter than most classes you will take at Rice, and the subject matter is for the most part interesting.",
                    "The research project was too much work for only being worth 7%.",
                    "This class wasn't very difficult, but the grading system was somewhat irrational. The heaviest percentage of your grade was the hw, and while it wasn't hard hw, it was time consuming and very easy to make mistakes on. Sometimes I felt it was graded unfairly. Otherwise, it was a good intro course.",
                    "good introductory course to linguistics",
                    "The course material was kept at a simple enough level to be managable, but was still very interesting.",
                    "This class introduces some fairly interesting topics ranging from word morphology to phonetics to social registers and speech and almost everything in between. Dr. Achard uses powerpoints to lecture, and these can all be found on the ANTH 200 website, so if you miss a class it's not the end of the world. Going to class does however have its merits, as the notes online usually do not provide as much detail or explanation as Dr. Achard does in class. Often, he also uses handouts with linguistic problems on them to supplement his lecture. These are often similar to homework and test problems and are therefore quite useful. There were about seven homeworks, three midterms (non-cumulative), and a paper. The last midterm takes place the last day of classes. These exams are usually quite straightforward if you were conscious during his lectures and if you take the time to read over some of the details in the text as a review. He teaches a lot straight out of the text, so the book is quite handy.",
                    "This course is very interesting for anyone wanting a broad survey of basic linguistics and the major topics in that field of study. It covers a lot of topics in not very much detail, including phonetics, phonology, semantics, syntax, sociolinguistics, language evolution, and more. It's a good class that doesn't require very much work.",
                    "It was a fun class and probably one of the easiest D2 credits a science major that can't write can find.",
                    "It's an interesting class",
                    "I was not really interested in this class but I needed it to graduate so I never got into the class.",
                    "This course covers a wide range of topics, most of which were interesting."
                ],
                "Title": "INTRO TO STUDY OF LANGUAGE",
                "Instructor": [
                    "Achard, Michel J."
                ],
                "Department": "Anthropology"
            }
        },
        "200910": {
            "001": {
                "Term": "Spring Semester 2009",
                "CRN": "(21107)",
                "Reviews": [
                    "The comment that the final review session was canceled on short notice is entirely inaccurate. The final review session was not canceled at all. It was held on the last day of classes, as scheduled in the syllabus which all students received on the first day of class. (They could also download the syllabus from OWL-Space in case they lost their copy or were not present on the first day of classes.) I conducted the final review as scheduled, and the TAs were also present. At the end of the review, the take-home final exams were distributed to all students present. I did have to cancel my office hours during the final exam study period due to being invited for a last-minute job interview in another state. Ideally I would have been on-campus during the entire study period, but I cannot realistically turn down a job interview in the current economic situation. However, I canceled the office hours only after confirming that the TAs would be available in my absence. I made it clear to students via OWL-Space and e-mail that while I would be off-campus, I would be in contact via e-mail, telephone, or OWL-Space to answer any questions. Since only one student had taken advantage of my office hours during the entire semester, I was confident that cancellation of my physical office hours would not be disastrous. I received no requests for help via e-mail or any other media. The only difficulty reported to me was that one student scheduled a time to visit the TAs during office hours but never showed up (despite the TA waiting for him/her all day).",
                    "This class was a nice introduction to linguistics, and although the workload was light, it was useful; it seemed to highlight most of the important concepts. The assignments relating to our self-recorded conversation were particularly enjoyable.",
                    "The course was organized fairly well. My main issue with the course structure is that homework assignments were not returned in a timely manner, and it became difficult to complete a homework assignment that built on the previous one when the previous assignment had not yet been returned.",
                    "The curriculum spread a wide range.",
                    "Great course, learned so many interesting things. would definitely recommend to others.",
                    "All the class lectures were well organized and well presented. You had to come to class to take notes b/c the lectures were not posted online. It'll be better if you do the required reading before-hand since you'll have to do then eventually when you do the homeworks. The homeworks helped a lot in the understanding of the materials. It was an interesting change from my regular engineering classes and I would recommend this class to the other engineers.",
                    "This course was intersting. I enjoyed learning about things that I would have never thought about. I enjoyed the class.",
                    "This course was alright, but it seemed like a lot of the information we learned was really obvious already. It wasn't until the second half of the course that I felt like I was really learning something I didn't know.",
                    "Material was interesting and presented in a concise, engaging way. Homework was relevant and useful.",
                    "I thought this was a well-presented survey course of linguistics; we didn't get into a lot of detail, but I enjoyed the breadth of material presented. I thought the reasons for wanting to study each area was well-explained, and the major points of each unit were similarly well-presented.",
                    "Very fun course, nice intro to ling. laid back. always something new to learn each class.",
                    "I loved this course -- the material taught was fascinating and thought-provoking. The pattern of the class was well organized and the homework assignments related directly to what we'd learned in class.",
                    "This intro course was very interesting and gave a very good overview of linguistics. The class was well organized and the homeworks and exams were easy if you kept up with the reading and attended lecture.",
                    "I thought that the course was well organized and informative.",
                    "Fairly interesting D2 course, light work-load, easy-to-understand text book. Two midterms and a final, as well as 10 homework assignments during the semester. Low-stress but sometimes less than inspiring.",
                    "Informative, quality introduction into the study of linguistics.",
                    "A decent class that provides thorough experience on basic linguistic.",
                    "The material in this class is very interesting. The book is excellent. Lectures were usually worth attending.",
                    "Decent course, with very interesting material presented. It provides a very general overview of the different subfields within linguistics. Homework really helps to reinforce concepts learned in class and doesn't take much time to complete.",
                    "This class was relatively boring. We worked at a very slow pace, and the lectures were not interactive at all.",
                    "The classes gives a decent introduction into linguistics. It isn't too difficult, although it can be boring at times. Recommended if you need a D2 class."
                ],
                "Title": "INTRO TO STUDY OF LANGUAGE",
                "Instructor": [
                    "Lanz, Linda A."
                ],
                "Department": "Anthropology"
            },
            "002": {
                "Term": "Spring Semester 2009",
                "CRN": "(23212)",
                "Reviews": [
                    "The course overall was very good. The information was well presented and the homeworks were helpful in solidifying the information we learned in class. The professor and TAs were also very helpful and patient when it came to questions. I enjoyed this class alot.",
                    "Although I am not a fan of overview classes, I felt this one was one of the better ones. The curriculum follows the textbook extremely closely, which results in a class which is very organized if a bit bland at times. To break things up I felt the TAs could have taught more than just once each, because I felt they were good instructors too. The most interesting parts of this course were at the very beginning with learning IPA and the respective problem sets, and also at the very end with the language acquisition and language endangerment sections. Much of the other material in the class I felt was not really that substancial.",
                    "Good course, the material is interesting but the class itself wasn't very engaging. The room it was in helped to encourage anonymity, but overall the actual learning process was fine.",
                    "A very good introductory course. I strongly recommend it!",
                    "Ugh! I found this class to be really boring. So much boring information. I'm pretty sure I visited every website I could think of to avoid listening to lecture. Maybe if you're into linguistics you would enjoy it..i know some people did..just not me.",
                    "This is an interesting course to learn about linguistics in general. The weekly homeworks are based on the lectures of that week so they aren't very hard. I enjoyed the class very much.",
                    "A very brief overview of almost everything in Linguistics. Fairly easy class with a lot of reading.",
                    "Good course, weekly assignments. Wish the rules regarding assignment submissions would be easier on us though :-( Late submissions are completely intolerated and I got screwed over for that.",
                    "The course was interesting at times, but undeniably boring at others. The work wasn't terribly difficult though.",
                    "This course is very well organized and well delivered to everyone, no matter what his/her major is. I took this class for distribution credit and felt very good about my choice. This course teaches so many interesting topics and make students ready to take deeper level linguistics class.",
                    "A good, fun class. Easy, too.",
                    "The course is not very challenging, but does provide an interesting look into various aspects of the broad field of linguistics.",
                    "This class is interesting and covers a broad spectrum of linguistics. A great introductory course that isn't all that difficult. There is a weekly assignment that should never take you more than two hours (and even that long is rare). You will be well-prepared for all the exams and the material is interesting.",
                    "I'm a engineer and I hate english courses but i love linguistics. This course gives you a general view of what other linguistics classes rice has to offer.",
                    "This class is boring, but it is easy as long as you do the homework and attend class.",
                    "Very interesting class but kind of hard."
                ],
                "Title": "INTRO TO STUDY OF LANGUAGE",
                "Instructor": [
                    "Morrison, Michelle E."
                ],
                "Department": "Anthropology"
            }
        },
        "201010": {
            "001": {
                "Term": "Spring Semester 2010",
                "CRN": "(21107)",
                "Reviews": [
                    "This was a fabulous course and if you are interested in studying languages I would definitely reccomend it. Work level was definitely appropriate for an intro level course.",
                    "I felt that the lectures were more interesting than average, and the homework never seemed too difficult.",
                    "WOOO HOOO!",
                    "Linguistics is an interesting subject that I'd never explored before. I found the organization of the class really good and the subject matter interesting.",
                    "I thought the class was interesting overall, though it could sometimes be annoying.",
                    "I took this course for fun and it was one of my favorite courses of the semester.The course provided a general and engaging introduction to the study of language.The work load was somewhat lighter compared to my other classes probably because the assignments were very well designed to help the students understand the subject. There were weekly assignments and a group project.The midterms and finals should be quite easy as long as you go over all the lecture notes before the test, which means a lot of people would probably lose their incentive for coming to class.I personally enjoyed the lectures a lot but I guess it really depends on the instructor.Prof.Pantos gave very clear and organized lectures with interesting materials.",
                    "Workload was much heavier when compared to the other LING 200 class offered this semester due to the independent project. However, class was good and opened my eyes to the world of linguistics.",
                    "This is a very interesting class that is not too much work. The majority of the material is stimulating without requiring too much of a time commitment",
                    "This class was very interesting. It went at a decent pace, and the material was presented well.",
                    "The information taught seems to be a bit dry at times and the necessity of reading the textbook diminishes as the semester went on. I thought that having some surprise bonus points for being in class and the inclusion of material not in the book in lectures helped keep class attendance relatively high.",
                    "Pretty straightforward D2 class. The problem sets contributed greatly to my understanding of the material. The workload was not that much, easily my least time consuming class. Tests were straightforward multiple choice exams. The course itself provided a survey of a multitude of topics in linguistics. I thought most of the topics were pretty interesting.",
                    "Great intro to study of language, provides a very broad approach to linguistics.",
                    "Great D2 class, and quite interesting. There were two tests, nine homework assignments (one is dropped), and a project where you conduct your own linguistic study.",
                    "This is a really good course, especially for ling majors. I suspect that it may feel a little tedious to any students that are only taking the class for distribution. The homeworks take a while sometimes so I suggest doing them a little a time rather than waiting the last minute. Overall, good class.",
                    "This course does a great job of introducing students to the different areas within linguistics. Even though it's structured like any run-of-the-mill introductory course, its organization makes all the material fit together and \"flow\" quite well. Interesting lectures and pertinent homework, too!",
                    "The material is very interesting, and the professor manages to make it so for every session.",
                    "Mr. Pantos is an awesome person and the TAs are very friendly. They do grade kind of harsh however so it is easier to like them outside the classroom then inside.",
                    "This class was a really broad but really interesting look into the study of linguistics. Not too hard or too much work.",
                    "Overall, this course was easy A.",
                    "Fairly easy class. Multiple choice tests. Was somewhat interesting, but way too much other stuff going on to care sometimes.",
                    "Dr. Pantos is a great lecturer. His slides were informative and easy to understand. The TA's were extremely helpful and also gave great lectures. Homework was very relevant and helped practice for exam questions. Just a well organized class overall.",
                    "I really enjoyed this class. Dr. Pantos and the TAs were helpful and clear in explaining the concepts and very reasonable with grading and the amount of work assigned. I would highly recommend this for a D2 class or for anyone exploring major options.",
                    "I took this class pass/fail so I did not devote the time necessary to get the most out of this course. However, it was very clear that if you had an interest in Linguistics and paid more attention then it would have been quite a fulfilling class. The class is not difficult. There are weekly homework assignments and three multiple choice exams. Additionally, there is a project, which is not terribly difficult.",
                    "Exams were mutliple choice and the final project was interesting. The homeworks actually helped in understanding concepts.",
                    "I hardly went so my evaluation should not be used."
                ],
                "Title": "INTRO TO STUDY OF LANGUAGE",
                "Instructor": [
                    "Pantos, Andrew J."
                ],
                "Department": "Anthropology"
            },
            "002": {
                "Term": "Spring Semester 2010",
                "CRN": "(23212)",
                "Reviews": [
                    "ANTH/LING 200 was a great introduction to topics studied in linguistics. Since this class was a survey, the topics were never covered in depth, but I came out with a decent understanding of the fundamental principles of language. LING 200 is a good class for anyone who likes identifying and working with patterns.",
                    "It's a good class and it is interesting, but I wouldn't say this is the greatest course out there. But if this class has caught your eye I think you will probably enjoy the class.",
                    "The course organization was excellent. We covered a lot of areas, not in depth, but still I have never dealt with linguistics and I have learned a lot. I really liked it. It was worth getting up before 9 am.",
                    "All the work was relevant, and I actually learned new things that I wanted to learn about",
                    "This course was a solid introduction to the various areas of linguistics, with adequate homework to ensure that the basic concepts were understood. I feel like I got a lot out of it, and anyone who keeps up and does well should have a lot of new doors opened to them.",
                    "The course was a very good overview of Linguistics. It allowed me to broaden my horizons in terms of linguistic knowledge and gave me the tools to go further on the different topic covered if I choose to do so. The class was powerpoint based, which made things rushed at times, but there were plenty of in class demonstrations that made things more enjoyable. The homework assignments did a very good job of making sure you understood the material. The midterm and final were comprehensive and were on Owlspace, which is still a service in need of more improvements before it can work without any glitches. The class also seems to be taught at a slightly harder level than the other Ling 200 classes. Regardless, this was an outstanding class.",
                    "The subject material in this introductory linguistics class was very, very interesting. For those out there who find how words, conversation, and language develop intriguing, this class is for you. As one taking the class as a DII elective, I found that it presented me with a source of new, exciting subject material compared to my other classes.",
                    "This was such an awesome class! The material was really interesting, and the homework assignments were actually fun to do! I would take it again in a heartbeat.",
                    "Interesting course. Recommended.",
                    "The course was very interesting and informative, covering a vast range of linguistic topics.",
                    "A good class overall, although sometimes it seemed like the Prof and the TAs forgot that we didn't know linguistics as well as they did.",
                    "Good class to take. slightly meticulous but pretty easy other than that.",
                    "Good distribution",
                    "Interesting class.",
                    "This is definitely a very interesting class. The workload is really light and homework is a great percentage. However, this is not an easy A class based on my experience. I guess that depends on the person, and I have reached conclusion that I am just probably not that good at Linguistics and I work hard but it doesn't seem to be very effective.",
                    "I thought this was a pretty easy distribution course. Some parts of the material were really interesting. I particularly appreciated the units in this course that gave me a new perspective on English and foreign languages. Show up to lectures, because you're going to learn most of what you need to know there. You don't have to read that much of the textbook; I mostly used it as a reference.",
                    "This is a fascinating course providing an extensive overview of the study of linguistics. The assignments contributed greatly to my understanding of the subject and I felt that the exams were very reasonable.",
                    "A fairly easy course. Homework once a week, one midterm, and a final. Mostly enjoyable, although some of the material got a bit boring.",
                    "Easy D2 course but I think I actually really enjoyed this class. The materials were new and interesting and the prof was certainly inspiring . The homework that's due every week really made you study so you don't have to cramm on midterm and final.",
                    "As a potential Linguistics major, I definitely found the material taught in the class to be interesting and useful. The class gives a good taste of the different fields of Linguistics. Definitely take it if you are considering majoring in Linguistics as it is a prerequisite for most upper level classes.",
                    "Interesting topic, sometimes the lectures were boring.",
                    "A good introductory course to those interested in Linguistics, and a course that can be fairly interesting even to those who have no conscious desire to learn more about Linguistics (yours truly included). The class gives a pretty balanced overview of the major areas in Linguistics study; though it does not go into terrible depth, it nevertheless reveals enough about the field and leaves enough open and unanswered questions to possibly warrant additional interest from the student.",
                    "This class was well taught, Ling just isn't my thing.",
                    "The course was well-organized, and the material was presented very well. I felt that I learned a lot!",
                    "Linguistics is a must take for anyone at Rice, the material in it is so interesting regardless of your default major background. It is such an important tool for understanding other cultures in this increasingly global society.",
                    "A very brief overview of almost everything in Linguistics.",
                    "Linguistics is one of those fields that you don't really think about it until your taking the intro class. Fascinating subject and interesting class. Now considering making it a major.",
                    "This course was harder than I expected and required more work than necessary.",
                    "Good intro class. I learned a lot about language that I had never thought about before.",
                    "A pretty easy class as long as you attend class. Lectures were mostly powerpoint presentations and almost all homework were turned in online. Also the online Owl-Space exams are convenient. The only hard part about the class is memorizing the IPA chart and transcribing.",
                    "Good class. The lectures were sometimes interesting (historical linguistics, conversation) and sometimes boring (sociolinguistics, syntax)",
                    "This course was really interesting and fun. The teacher was really great and I was really excited to learn about all the things regarding linguistics. The things we got to do were also really fun and different from anything I'd ever done. The assignments got increasingly difficult, though, but there was help available.",
                    "Since it is an overview of many topics, it's hard to feel like you completely understand all of them as much as you could. The subjects are relatively interesting."
                ],
                "Title": "INTRO TO STUDY OF LANGUAGE",
                "Instructor": [
                    "Englebretson, Robert E."
                ],
                "Department": "Anthropology"
            }
        },
        "201110": {
            "001": {
                "Term": "Spring Semester 2011",
                "CRN": "(21107)",
                "Reviews": [
                    "Great introductory course to linguistics. It made me more aware of our amazing ability to create and use languages. 50% of the grade is 8 homework assignments and the rest is based on a midterm and a final. The homework can be a bit challenging at times but going to office hours helps. Overall I'd highly recommend this class.",
                    "The homework assignments were not at all related to what was talked about in class and were left field in comparison to what was on the exams. The TA's were awful and could not explain what to do or what we did wrong as a class. They also took forever to grade the homeworks, which counts for half of your grade, so you didn't know where you stood in the class until it was too late in the semester to do anything about it. Lectures were random and often times boring.",
                    "material is a bit too cursory but otherwise good class",
                    "This course was a decent one as an introduction for Linguistics. It covers the basic topics decently and the book explains things pretty well. There is a weekly problem set and a midterm and a final that are relatively easy. There is also extra credit sprinkled throughout the course.",
                    "Some of the homework questions were wierd and hard to answer. This was frustrating because homework is worth so much of the overall grade. Other than that, though, the homeworks were not that bad.",
                    "It was a rather boring class to be honest. I though that it would be really interesting, but it very quickly became tedious. If you liked English class in High School, there are some aspects that were similar.",
                    "The only thing I didn't like about this course was that the homework assignments counted for so much of the final course grade. The homework assignments were graded by TA's, and some of the TA's seemed to be more lenient with their grading than others.",
                    "The teaching of the material could have been better.",
                    "Homeworks were a little abstract and up to the judgement of the TA's.",
                    "Easy course, but very dry material that makes it difficult to concentrate in class.",
                    "Very well structured so one can plan their semester and develop a consistent routine to keep up with the readings. Although class attendance isn't mandatory, there was enough in-class material taught that wasn't available in the textbook to the point where students who went to class had a clear advantage on tests (as it should be).",
                    "Interesting material, but could've been presented better.",
                    "Just read and you'll be fine. There's only a few things that you can only get from class, or just common reasoning. Pretty easy d2 or a good class to pass/fail. 50% was homework, 25% Mid-Term, 25% Final. Just don't miss any homeworks.",
                    "This course didn't require a whole lot of work. Reading the book to do the homework each week was more than enough for me to do fine on both of the two tests. Would have been interesting with a less monotone teacher.",
                    "I had a hard time getting myself to go to this class after spring break. I didn't find the material particularly interesting. There was a ton of reading, a lot of which I felt was unnecessary. I only took this as a distribution requirement, but now I feel there are better options for this category.",
                    "The class was very easy. However, I did learn many interesting things about language. I just wish I had more of an outlet in class to apply that knowledge rather than just simple weekly homeworks.",
                    "Most of this course in common sense. Chapters in the book are typically twenty pages long, and in that time it only manages to say something like: You use more slang when your around your peers than around adults, and you write even more formally. In multilingual societies, the same thing happens, except its different languages altogether rather than slang/formality. Basically its all common sense.",
                    "The hw assignments are the worst part of this class. They come from the textbook but there is rarely enough information to answer the question fully or confidently. You can do well without going to class but she likes to test on things she says in class/she emphasizes things that the book doesn't.",
                    "The TA's were quite harsh in grading the weekly homework. This class was more work than I had expected and concentrated on minute nit-picky things."
                ],
                "Title": "INTRO TO STUDY OF LANGUAGE",
                "Instructor": [
                    "Crosswhite, Katherine M."
                ],
                "Department": "Anthropology"
            },
            "002": {
                "Term": "Spring Semester 2011",
                "CRN": "(23212)",
                "Reviews": [
                    "A true seminar course, It doesn't rest on any one topic for very long so don't miss class. The material is easy to understand but there is a lot of it and it involves some memorization (not my favorite).",
                    "The course itself is fun, but somewhat hard for international students since it's the study of English.",
                    "The teacher was great and I found linguistics much more interesting than I thought it would be.",
                    "I liked this course because the professor was organized.",
                    "its a really good course to take, and not too much work!",
                    "This course covers all the basics of linguistics. I'm not a fan of the discipline, so it's hard for me to say it was an amazing class, but the material was well organized and the homework and exams weren't hard. There were homework assignments every week on lecture material. The midterm was multiple choice and short answer, and the final was all multiple choice.",
                    "This was a really good introductory linguistics course. It was interesting and not too hard, and it makes me wish I had time to take more ling classes.",
                    "I really enjoyed the material covered in this course. It was all pretty interesting and the book was helpful and easy to read. Also, the workload was manageable with only one midterm test, a project, and a final. There were homework assignments every week but they were not too time consuming.",
                    "Absolutely the only problem that I had with this course was that I felt the homework made up too high a percentage of the grade. Other than that, the class was wonderful. I felt the material was covered well and in a very organized manner, and the professor's expectations were always clear.",
                    "Cool",
                    "Class lectures were very useful and understandable - Pantos did a great job of explaining linguistics.",
                    "This is a pretty good class. Only annoying part was learning the IPA, but other than that it's a pretty easy, straightforward class.",
                    "Interesting material, and very well organized--the content is softer than most, so I put it behind my other classes when studying for the midterm (huge mistake since this would have been an easy A). Grades fairly. I liked how the grade was spread out (midterm, final, homework, project).",
                    "It was a nice class to take for distribution. Focus is on American English. We had to do a linguistics study which I thought was kind of cool to do.",
                    "Class was good - sad to see that it is Dr. Pantos's last year at Rice. Rice should definitely do a better job of keeping good professors.",
                    "Basic knowledge about language. Not so appealing.",
                    "This class was very organized and well structured. I found the material very interesting, and I was glad the course introduced us to all of the units and topics of the textbook. I highly recommend this class.",
                    "I really can't find anything to complain about this course except for the fact that I personally found the topic to be pretty boring. The course load was very reasonable, the tests (one midterm and one final) were all or almost all multiple choice and pretty simple, and there was just one group research project that was pretty interesting. I personally just couldn't really get excited by the lectures and so I struggled to pay attention, but that wasn't so much the course's fault.",
                    "I actually enjoyed doing the homeworks; they were almost like puzzles. I found the subject matter very interesting as well and I thought the lectures were entertaining, informative, and enjoyable.",
                    "Took this without really knowing what linguistics material is. Hated it. Make sure you might be even remotely interested in the subject. If not, choose another D2.",
                    "I thought this class was really interesting, and I felt like it did a good job of going over a lot of basic topics in linguistics. Work was graded promptly and homework wasn't too bad (except it did feel a little tedious after some time) and helped to reinforce a lot of concepts that were discussed. Overall, though, this was an excellent course--I definitely recommend it, especially if you're looking for a D2.",
                    "Good survey course for linguistics. It was boring at times, but I think that's because I didn't find the material all that interesting to begin with",
                    "The general consensus was that some lectures were far more interesting than others: for me, the class reached high points over the first and last two weeks. Overall though, the class definitely teaches you the details of a field unknown to most people and I thoroughly enjoyed it. The homework is fun, too!",
                    "Class is soooooooo boring. I took this only for the easy A. Tests are much easier than the homeworks. Homework can sometimes be a pain, but that's mostly because the msterial itself is so dry and you know you'll never use what's in the hw ever again in your life.",
                    "This class is a great introduction to the field of Linguistics. We covered a lot of different topics briefly, which helped me realize which areas in Linguistics I enjoy, and which other Ling classes I should take.",
                    "If you like language you will LOVE this class. Very interesting history and process of how speech and language is learned, formed, developed. Very complete introductory class.",
                    "This course is very interesting. Common D2 distribution course, though I knew several majors in the class. I didn't know prior to the course just how detailed language actually is. 2 exams including final, weekly homeworks. Lot of your grade is based on TA, and mine tended to be strict (B's on weekly homework, poor test grade). Though you will learn a lot, an A is hard to attain.",
                    "Be warned--this course and the instructor are intense. If you do not do the homework (I did) and show up regularly to class, you will easily get lost. But the course is a solid introduction to linguistics. Do not, however, expect it to be an easy D2. Flashcards are essential to prepare for the exams. Also, the paper requires much communication, so it is advised that you take this class with someone that you know well so it will be easy to coordinate group efforts.",
                    "Fairly interesting and engaging distribution course, the lectures often related linguistics to other topics and sometimes included discussions as well.",
                    "Great class",
                    "I didn't really pay that much attention in lecture because the lecture slides were posted on Owlspace and I could just refer back to them later for assignments. The assignments weren't too hard and neither was the midterm. The book is useful for more detail in the concepts you learn in class but you really could get by without one. The professor also enjoys engaging in discussion in the class. If you're interested in the ideas behind linguistics you'll find this class very interesting, if not then you'll find it pointless to go to class."
                ],
                "Title": "INTRO TO STUDY OF LANGUAGE",
                "Instructor": [
                    "Pantos, Andrew J."
                ],
                "Department": "Anthropology"
            }
        },
        "201210": {
            "001": {
                "Term": "Spring Semester 2012",
                "CRN": "(21107)",
                "Reviews": [
                    "I heard this class was an easy A and while some effort could get you and A, the professor made it harder than it needed to be. Hw's are time consuming",
                    "Interesting course, but the homework assignments were way too long.",
                    "This class took some getting used to. Ling is something none of us have really studied before so it takes some getting used to. That being said I learned a lot. It is interesting stuff but I don't think I will be pursuing any more ling.",
                    "This is an interesting course that really opens up your mind to new ways of thinking about languages. It also involves some fun problem solving and a very minimal amount of memorization.",
                    "The majority of the course was clearly presented, although there were times where instructions were not clear or the material was presented in a confusing way. The book did not always correspond well with the lectures, and it was often difficult to find information that was not explained well in the lecture. Additionally, there were several homework assignments that covered information not covered very well or at all during class. The teaching assistants were a helpful resource for answering questions.",
                    "The prof for this course was good, and the TAs amazing. The study of inguistics is just for a certain type of person... not me;",
                    "Don't take it if you're looking for a D2 credit. Way too much work for an introductory class.",
                    "I was just not very enthused with this course. The large amount of detail required for the homework was not the detail provided in class.",
                    "Didn't find the material very interesting, and thus made it hard to find the motivation for homework and studying for the midterm and final.",
                    "lots of work. Topic is tough to see the \"point\" of sometimes and the professor had to spend a fair amount of time telling us why studying this really was important. Influenced my lack of motivation.",
                    "The course was effective at presenting a broad overview of the field of linguistics. The main detractor was that lectures were often given hastily and without a well-organized presentation of the material. Additionally, the subject matter in the homework assignments was not always well explained in the lectures, making it hard to complete the homework. I had to rely on the book for completing many of the homework problems, which seems to defeat the purpose of a lecture course.",
                    "If you have any sort of interest in linguistics, this is a great course. Like most courses at Rice, you get out what you put in. If you are taking it for distribution, it is easily passable. If you are taking it because you may want to go into linguistics, or linguistics knowledge may be useful for your studies, you will learn a lot.",
                    "Fantastic class! Very engaging teachers and subject",
                    "This class COULD be an easy A, but if you take it with Niedzielski, it will definitely NOT be a blow off! The homeworks are weekly and are a bunch of busy work. Some of them took me 3 or 4 hours to do! Class is a waste of time if you don't actually care about linguistics, like the majority of the class. It starts of interesting and then gets really boring and redundant. Weekly homeworks, 1 take home midterm, 1 take home final, and 1 mini project [a paper or a 5 minute in class presentation]. I really wouldn't recommend this if you're going for an easy A, it's a lot more trouble than it's worth.",
                    "This course was okay at best. The lectures were boring, and often extremely repetitive. For a ling 200 class it also had a good amount of work required. The homework's were usually vague and did not help teach concepts.",
                    "I thought it was a lot of information to learn with such a basic course",
                    "A very interesting course on how language changes, how people acquire language, and sound patterns and syntactical structures of various types of languages around the world. It's not about \"proper grammar\" or the boring stuff that linguistics is usually stereotyped as, and it really makes you think about language and interaction/communication in everyday life. I took this just as an easy DII and it turned out to be my favorite course this semester. I have heard that it depends a lot on the teacher, though, and Dr. Niedzielski was absolutely fantastic, so that may have been part of it.",
                    "It was ok. Some lectures were really boring and some were really interesting. You could tell that the professor was really interested in teaching.",
                    "tough class",
                    "Pretty standard intro to linguistic course. My main complaint is that the grading was largely determined by which TA you had grading your assignments. My friend and I did our HWs together but she always got a higher grade than me because her TA was Carlos and mine was Claire.",
                    "Good course, weekly homework doesn't take too long but helps reinforce the material in the lectures. Really helps to go to class, especially since class was usually very interesting.",
                    "I rated this class as fair because I found the first half of the course very interesting, but the second half of the class was taught in what I think was broader terms. I was lost in much the second half of the class and understood just enough to do the work, I believe. I like the technical stuff better.",
                    "This class was MUCH harder than I expected! I thought it would be an interesting and relatively easy introduction to language, but not at all. The HWs were hard, the lectures weren't posted online, the material was difficult. I did not enjoy this class at all and was forced to pass fail it despite trying hard in it. :(",
                    "This class is a fairly straightforward introduction into Linguistics. I took this class for distribution and found it quite enjoyable. The only issue I had was that sometimes lectures moved too quickly and it was often the case that we learned the material on the homework after it was due.",
                    "This course never engaged me, even though I often hoped that it would, and wanted to discuss the interesting aspects of language. Also, the weekly homeworks were banal, long, and completely unhelpful unless you wanted to really follow linguistics. This is NOT a fun D2 for someone just looking to learn a bit about an random field.",
                    "Good course. Well organized and medimum difficulty level.",
                    "Homework counts 60%. Which is really annoying when the TAs are so nitpicky about grading. None of what was on the homework we learned to do in class.",
                    "Good intro course, lots of interesting stuff for all majors. 2 take home exams and homework every week which is pretty easy if you pay attention in class"
                ],
                "Title": "INTRO TO STUDY OF LANGUAGE",
                "Instructor": [
                    "Niedzielski, Nancy A."
                ],
                "Department": "Anthropology"
            },
            "002": {
                "Term": "Spring Semester 2012",
                "CRN": "(23212)",
                "Reviews": [
                    "The course was a solid introduction to linguistics and is a relatively easy D2, but I didn't find the material particularly enjoyable. Your grade is made up of one quiz, one final, weekly homeworks, and participation, so plan on attending most lectures. Reading the textbook is not necessary since all the info you need is on the PowerPoint slides which are posted online, but the homeworks can be somewhat time-consuming for a D2 if your goal is an A.",
                    "We had weekly homeworks and readings for each class. The material was fairly interesting, but the professor's manner of teaching was as dry as possible.",
                    "Didn't really like this class. It just wasn't very interesting and I wasn't motivated to learn from the professors teaching. Only take this class if you really want to learn about linguistics.",
                    "I thought that the homeworks were graded unnecessarily hard as compared to the tests, though maybe that is balanced by the fact that there is only one midterm, and then a cumulative final. The final is easier than the first midterm and I feel this may help balance the grades, the homeworks definitely teach you a lot though. The content of the course is a bit boring but I think I may have just found out I'mt not a huge fan of linguistics.",
                    "I didn't understand most of the things that were taught in class.",
                    "A very broad look at the science of linguistics, we didn't go too much into depth on anything, but got a very thorough base. Homework was light and readings were not difficult. The course was very clear and well organized.",
                    "This was a generic d2 class at Rice",
                    "As someone who was just looking for a distribution, this class surprised me with how much it interested me. It's not just straight memorization and doesn't require too much time.",
                    "This class didn't really stand out to me. I took it for distribution, and it ended up not being too exciting. It was an easy distribution, though. I don't plan on taking more linguistics classes after this.",
                    "The majority of the grade comes from the assignments that are not too difficult if your ask questions and go to office hours. It is also interesting once you get past the beginning chapters."
                ],
                "Title": "INTRO TO STUDY OF LANGUAGE",
                "Instructor": [
                    "Yoon, So Yeon"
                ],
                "Department": "Anthropology"
            }
        },
        "201310": {
            "001": {
                "Term": "Spring Semester 2013",
                "CRN": "(21107)",
                "Reviews": [
                    "Easy course if you do the work and the readings",
                    "Much easier compared to other professors. Laid-back presentation of material. You get what you put in.",
                    "This was a pretty interesting course that offered some insight into other studies (since my major is in the natural sciences). It's also not too difficult to get a good grade, so I think it's an excellent choice for distribution.",
                    "The class provides a good introduction to a variety of topics in linguistics. The homeworks were most useful in learning the material for the midterm and final.",
                    "This was a pretty straightforward class in terms of workload and test preparation. It was pretty interesting at times and served as a good introductory course to linguistics.",
                    "Easy class to pass/fail",
                    "This course isn't organized very well, making it hard to figure out what is important to pay attention to. Two take home tests and homework that is worth 60% of the grade. It wasn't enjoyable, but an A is definitely possible.",
                    "This was a great distribution course to take. Not too challenging but still interesting.",
                    "The class itself was really fun and interesting, and I learned alot about linguistics that I never even thought existed. Overall, this class was a good comprehensive review of linguistics and all its facets.",
                    "This class was a good overview of the study of linguistics. I took it because of the Cog Sci major requirements, but actually found the material quite interesting. 1 midterm, final, 8 assignments (1 of which is dropped). I thought that the assignments helped me prepare for the exams well.",
                    "This class was very interesting to me. I think the homework was awesome as a preparation for the tests and helped to integrate what we learned in class.",
                    "Easy class...good for distribution credit.",
                    "Good course, but since I’m not a linguistics person, I found it hard to be engaged in the material sometimes. Even so, the course is well designed and organized that I recommend this course to people looking for a good D2 or just interested in linguistics. Dr. Taylor may be a little bit wacky in his jokes, but that was a plus factor for me. The workload wasn’t too bad; expect around a full day of studying before the exams though (if you haven’t been studying regularly, that is).",
                    "I thought it was an interesting class with interesting material",
                    "The course feels overly rushed. Entire linguistics principles (phonetics, morphology, syntax,etc.) were done in a week.",
                    "The class is a good D2, relies a lot on homework, but it's not too hard/time consuming. if you do the work, you're likely to get a good grade.",
                    "Interesting class! I enjoyed all the topics that we covered. It was a good overview course and a great intro.",
                    "This was a really good class with an amazing professor who was very understanding of people taking for distribution.",
                    "This was a difficult class for distribution, but Professor Taylor was really interesting and engaging.",
                    "This class was extremely interesting! The course itself was not very rigorous, but I still learned a lot. There were homework assignments every week or two, one take home midterm, and one take home final. The exams were mostly multiple choice. I enjoyed almost every aspect of this course, except maybe discourse.",
                    "This course was poorly run by the professor.",
                    "Good distribution course. Some concepts were confusing, but Dr. Taylor did a good job to explain them to us.",
                    "A good D2. The material can be interesting, but you really get out what you put in. The workload is pretty light, but some of the homework assignments can be a little time-consuming. We had a homework assignment every week or two, a midterm, and a take-home final. Dr. Taylor knows it's an intro class and does his best to keep the mood light and interesting.",
                    "Do not take this course if you are looking for an easy D2. The TA's graded the homework too harshly and made the class a lot harder than it was supposed to be. The class consisted of only homework, a midterm, a and final, but I did not enjoy the class. The professor was geat but the class wasn't.",
                    "If you are going to take this course, take it with Chris Taylor! He is super easygoing and will rap for your class.",
                    "Easy intro to linguistics.",
                    "Good intro course, very general & broad stuff!",
                    "The class provided a very broad overview of various linguistic forms and processes. It was very interesting. There was very little work for the class- 8 homeworks, one midterm, one final, and some (optional) readings.",
                    "I didn't learn a lot from this class. Lectures were extremely boring, although it was clear that the instructor was trying to make it exciting with all the jokes and examples that might resonate with the \"undergraduate\" population. However, I thought most of them were pretty lame. I would've preferred more structured lectures even if they might be a bit more dry and information-heavy. I don't think I got any tangible knowledge out of this class. Workload is not bad - 8 assignments throughout the semester, 1 take-home midterm and 1 take-home final.",
                    "The course was a lot of fun. The material was pretty interesting, and Dr. Taylor is a very enjoyable and funny lecturer. The class was very laid back. We had homework almost every week, but it was generally just a worksheet. Overall, the class was enjoyable and easy, but I don't feel like I learned a lot.",
                    "This is everything you want in a class (if you take it with Taylor). Very interesting material, homework doesn't take long but still teaches you something, very good lecturer, and not hard to get a decent grade. And you get distribution credit. Take it."
                ],
                "Title": "INTRO TO STUDY OF LANGUAGE",
                "Instructor": [
                    "Taylor, Christopher M."
                ],
                "Department": "Anthropology"
            },
            "002": {
                "Term": "Spring Semester 2013",
                "CRN": "(23212)",
                "Reviews": [
                    "This is a good D2 class for someone who is looking for something that is not too challenging but a class in which one can learn something from.",
                    "It's interesting, if a little heavy on the phonetics more than I expected.",
                    "The assignments in the class really built upon the material. It was a good overview of the basics.",
                    "This is a great course that provides an excellent introduction to the study of language. It covers all the essentials, like phonetics, morphology, syntax, grammar, and much more. My only worry was that this class presents those concepts in a more or less mutually exclusive sense in that it doesn't transition very well between the different concepts. Although, for an introductory class, LING 200 does a good job addressing the key points and briefly bridging them within the context of linguistics, considering that it is a comprehensive introductory class.",
                    "Average introductory course that doesn't really stick out in my Rice experience. Wasn't stimulated by the material or its presentation.",
                    "I think this course is a great introduction to linguistics. I didn't personally find the subject material to be terribly interesting, but I don't think that was any fault of the course format or the instructor.",
                    "LING was a great class, really interesting and a broad, manageable overview of the field",
                    "Pretty fun and interesting D2 credit--grade is based on weekly homework (which doesn't take too much time) and two online exams.",
                    "Took it for distribution. Not as easy as I thought it would be",
                    "I found out mid-way through the year that I do not have an ear for linguistics. I can't distinguish between the vowel pronunciations, so I was lost a little bit throughout the entire class. My TA was a little unnerving but if I needed assistance I could just email Dr. Englebretson. Expect a bit of work for the class, the exams are difficult but doable if you study. Closed book exams but you do get a work sheet which you can do beforehand to assist with answering some of the questions.",
                    "fun class",
                    "This class is a decent distribution class. The work is easy, but the homework was graded rather harshly. Since the homework is a large part of the overall grade, your grade is hurt. Other than that, the tests are easy, going to class isn't entirely necessary and one can get by without reading or trying much.",
                    "Dr. Englebretsen makes this course feel like a big puzzle game. The assignments are actually kinda fun (yes, I know that sounds crazy)and definitely make the information very easy to understand. The only negative is that the TAs grade hard sometime. Nevertheless, I put in absolutely minimal amounts of effort and earned my B+ easily.",
                    "This course had a ton of work for being an intro level class. The grading was really harsh so I decided to take it pass/fail. There was only one midterm and one final and they were pretty manageable if you studied and had gone to class.",
                    "This class was way harder than I expected it to be. It definitely isn't an easy A (depends on the professor you get), so expect to either do all the readings or come to class. He'll also ask questions on the final about what is said in class but isn't in the book.",
                    "This was an excellent course to take for distribution credit and I thoroughly enjoyed the topics and material presented",
                    "Covered all aspects of linguistics somewhat superficially. Interesting if you like linguistics, otherwise the material can be pretty dull. The work load is absolutely doable. 9 homeworks (one is dropped), one midterm, and a final.",
                    "Overall an easy D2 credit to take. Workload was very easy to manage and the assignments perfectly prepared the students for the midterm and final.",
                    "The coursework (homework assignments) were tough at times, and graded rather strictly. There aren't many corners in this class I could cut, so I'd recommend putting a lot of time into this class if you want an A.",
                    "I really enjoyed Ling 200. Some of the lectures were a bit dry every now and then, but Dr. Englebretson kept things interesting with his humor. There's basically a homework assignment due every week or so- they take probably around 2-3 hours for each one. They really do help you understand the material as you work through them (especially morphology). If I had to make one change to the course, though, it would be about the phonetics homework. It's *very* difficult, and most people failed it (which was par for the course, we were told). To make it a bit more \"passable\", I think the format of it should be changed slightly (converting IPA into English? Having the students transcribe some, but not all, of a word?). The way the course works, your lowest HW grade is dropped, but with few exceptions, the Phonetics homework will be the worst HW grade, so the whole \"We'll drop your lowest\" kind of translates to \"We'll drop the phonetics HW grade\", which makes the policy a bit misleading, IMO. That's a really minor gripe, though. This class was pretty great overall, and aside from that one particular assignment, I thought the other assessments in the class were really fair (and not all that difficult).",
                    "If you're at all interested in language or linguistics, I would definitely recommend this course. A lot of the material is pretty easy and intuitive, but be careful on the homeworks!",
                    "This was a typical intro level class. Pretty easy to get bored unless you are actually genuinely interested in linguistics.",
                    "This course is both extremely interesting and engaging. With all the resources available to help you master the material, a low grade is most likely due to lack of effort on the student's part. I enjoyed the challenge immensely, and I have several classmates who decided to take more classes in Linguistics because of this class.",
                    "I came into this class with the attitude of \"this is just a class I have to take\" and came out of it with a genuine interest in linguistics. The class was very lecture-oriented, which I liked (probably wouldn't have even had to buy the book). Fascinating material and presentation, without being overly demanding.",
                    "The class was a good introduction to Linguistics, which can be good or bad for some people. I personally thought the material got kind of dry, but that may not be the case for everyone. Definitely take this class if you're interested in learning some cool stuff about language. By the way there's only one midterm and final.",
                    "Kind of a tough class if you're not really interested in it. Usually weekly homework assignments that take about 3 hours to finish. A lot about grammar instead of culture stuff, which was boring for me.",
                    "Interesting class, very different from what I expected, and fun.",
                    "Really interesting class to take even if you have never thought about linguistics before. I originally took it for distribution, but will now probably be a ling major.",
                    "The course was extremely well organized. Dr. Englebretson gave us handouts to print out before class (or he would supply hard copies in class)that were very helpful to take notes on and for following along with the slides. I thought the material was extremely interesting, especially phonology and sociolinguistics, though at times the class could have moved at a faster pace. The work load also wasn't too bad. We had weekly homework, but it didn't take long and the examples in class were often sufficient for understanding the homework. All in all, I highly recommend this course!!",
                    "This class is a good overview of a lot of different linguistic topics. I'd recommend it to anyone looking for an interesting distribution credit or a taste of linguistics.",
                    "Fantastic D2 course! The material is interesting and the workload is not bad at all: 2 exams, easy weekly homework, and an optional essay for 5% extra credit."
                ],
                "Title": "INTRO TO STUDY OF LANGUAGE",
                "Instructor": [
                    "Englebretson, Robert E."
                ],
                "Department": "Anthropology"
            },
            "003": {
                "Term": "Spring Semester 2013",
                "CRN": "(28094)",
                "Reviews": [
                    "An extremely good distribution course to take. Linguistics was both interesting and engaging. The lectures also greatly contributed to the learning experience. Definitely not one of those academ classes where you just spend time doing readings.",
                    "The was an extremely interesting course, I loved the material, and the teacher was extremely kind and understanding.",
                    "The class was quite interesting and I actually really enjoyed it, even taking it it for distribution with no plans to take any more linguistics courses.",
                    "Really interesting course; some topics were harder than others, but Dr. Nelson is willing to meet and work with you on them. Definitely do the extra credit because it helps in the end",
                    "Homework contributed nicely to the course material. It helped me extend my capabilities and helped me learn the material. Some classes were boring and others were interesting, it depended on what we were learning. Three tests: Overall, were not that bad.",
                    "LING 200 is an excellent class. Before taking it, I didn't really have any idea of what the study of linguistics entailed, or how it was applicable to the real world, but this class is a great intro to a really interesting, important field of study.",
                    "I really liked Ling 200. The class covers a general outline of many linguistics topics, all in one semester. The topics were well-organized on power points, there were 11 homework assignments (some were a little too long/unhelpful), 3 exams (no final!) and a report that was only 200 words, along with another optional report for extra credit. The tests were very fair and had a slight curve, but it was really whatever you put into them, some people didn't put in much work. Class discussoins were helpful and all questions were answered promptly.",
                    "I've signed up for this class 5 times and always dropped it. This time, it was fun and interesting.",
                    "I made the poor decision not to attend this class, and my responses should not be credited.",
                    "Great class: informative, interesting for the most part, and a relatively easy DII.",
                    "A very interesting and informative introduction to linguistics that takes a functionalist approach to studying language and covers all the major areas of the field. I came away from the class with a better understanding of how language works, and lately I've noticed myself catching patterns in people's speech that we've learned about in class. Ling 200 is a great distribution for people who want a class that's easy but also interesting.",
                    "I'm glad I took this class with less people in it because I actually ended up learning a lot. With Dr. Nelson, the class made for a good DII as the course work was not heavy and it was sometimes enjoyable. Three shorter tests, a one page report, and homework assignments that were easy enough for a non-linguistics major. Definitely would recommend this class for someone looking for a DII.",
                    "The class is straightforward. Attend lectures or read through them on your own time. Easy stuff if you actually take the time to learn it. It's also very applicable if you plan on learning or improving any foreign languages."
                ],
                "Title": "INTRO TO STUDY OF LANGUAGE",
                "Instructor": [
                    "Nelson, Katherine E."
                ],
                "Department": "Anthropology"
            }
        },
        "201410": {
            "001": {
                "Term": "Spring Semester 2014",
                "CRN": "(20301)",
                "Reviews": [
                    "First half of the course was more challenging, and I feel like I got more out of it.",
                    "Great class!",
                    "Course was interesting.",
                    "Great class! Learned a lot about how language can affect society.",
                    "The course structure was pretty loose. There's not too much material, and it's not too rigorous a course. A good distribution req if you're interested (if you aren't, it can get pretty boring). More LING than ANTH by far in my opinion.",
                    "This is an easygoing class that can teach you a lot about linguistics. 6 Homeworks one midterm and one final paper all of it was pretty chill.",
                    "This was a really itneresting course and Dr. TAylor is a really funny guy. The only problem with the class is that it can be disorganized at times. Dr. Taylor also emails people back many days after you send him an email so it's better to talk to him in person. He's really flexible and always willing to help you out. The book isn't really necessary to buy so you can just borrow a friends if you need clarification on something but you really don't need to buy it.",
                    "Good D2 credit. Pretty interesting material if you pay attention.",
                    "The class was interesting and was a great intro to ling!",
                    "LING 200 is an interesting class and it is not too difficult.",
                    "The first half of this class is great, and has very clear goals and curriculum. The second half is pretty aimless. It wasn't that there wasn't material to teach, but more that the curriculum was underdeveloped so the class just sort of wandered.",
                    "This course consists of an exam and a final, with hw every other week or so. It is fun, and it teaches you a unique perspective of the world. The book is not useful, and he will change the requirement to a recommendation next year.",
                    "Much of the class didn't go into much depth at all",
                    "I learned a lot about how to think about the impact of language on social systems and vice versa. Good class with a super cool prof.",
                    "The first half of this class was interesting but then the first test was ridiculously difficult. I wish the exam had reflected what we had learned from class, the reading, and the lectures. It seemed like part of the problem on this exam was that it was multiple choice which did not fit well with all of the material. The second half of the semester we didn't seem to learn much. All that we did for the second semester was have long repetitive conversations about obvious topics.",
                    "Easy D 2 class.",
                    "About 5-7 assignments like every week or so on material. First half of course is about syntax, phonology, semantics, etc. midterm was take home. Second half of course was definitely more interesting where we discussed language and culture, ideology, myths of language. Very interesting second half. Take home final that was about language and culture. Overall a good D1 or a interesting course to take just because.",
                    "Class is very easy and laid-back. Unfortunately, I didn't feel that I learned anything by the end of the year.The assignments were very easy. I do not recommend this course if you are really interested in learning about linguistics. That being said, if you don't know anything, its an easy A and it is somewhat of an introduction.",
                    "Ling is interesting but I'm not sure how much new information I really got out of this. Supplementary readings besides the textbook might've helped",
                    "The work load for this class was very manageable and pretty interesting for a D2 credit. A majority of the class grade was dependent upon the homeworks which made doing the homework more beneficial.",
                    "Material is not interesting and connects poorly. It's an easy distribution but certainly difficult to stay interested.",
                    "Great course -- we covered linguistic tools and methods for studying language in the first half of the course and analyzed sociolinguistics and language ideology in the second half. Assignments were helpful, midterm and final were fair.",
                    "Really enjoyful course. Lectures are so interesting and fun. Also, this course has 6 hws and 2 exams. All exams are take home. Each homework takes at most 3 hours to finish.",
                    "This is a good class. The first half of the semester in particular. It seemed like the second half lost the organization and structure of the first half and lectures stopped being posted online, but it was still manageable and lectures were always entertaining. I was definitely not a fan of the essay-style final exam, and was expecting an exam more like the midterm.",
                    "Super chill class and I feel like it was a good intro to linguistics! Professor Taylor is awesome, definitely take intro ling with him. We had several hw assignments that made up 60% of our grade, a take home midterm, and a take home final paper that was very short- 2-3 pages.",
                    "This class is a good intro to linguistics for people who do not want to focus on the detailed phonetics and IPA material. We learned about and had homework on IPA, morphology, phonology, syntax, etc., but closer to the end of the semester, the class began to broaden and explain the use of linguistics in everyday life and in a social context more than just the actual study of the structure of language, which is useful for people who are not linguistics majors but are still interested in the topic. Go to class! And pay attention! The PowerPoints he presents in class will really help on assignments. One midterm (take home), a few homeworks (all pretty easy as long as you go to class and use the slides after), two essay style homeworks (1-2 pages), and a final essay. Overall a good intro class that really helped me understand the role of language in society.",
                    "LING 200 was organized with 8 homeworks (every two weeks), a take-home midterm, and a final essay. However, Dr. Taylor had multiple conflicts this semester, so we had less homeworks assigned. Generally, the first part of the course (more intro to linguistics) was really interesting, and the homeworks were like puzzles. The second part (more anthropology) was on sociolinguistics and was not as interesting and seemed redundant and circular in explanation. Overall though, I enjoyed the course, and I was pretty entertained throughout the course. Dr. Taylor tells pretty funny jokes in class!",
                    "Professor Taylor is really funny and makes you think. This was a very entertaining class, a good balance to all of the boring/hard classes that we are required to take",
                    "This was one of the most laid-back classes I've ever taken at Rice. There were 5-6 assignments that were pretty short and not too challenging. There was only one take home test and one take home final. It's a class that involves very little work but still is interesting, and Dr. Taylor is really flexible about allowing students to push back exams.",
                    "Dr. Taylor is a really nice guy who tries hard to be fair and keep the class engaged.",
                    "So this course was very interesting. The bulk of your grade comes from your homework which at times can be a bit challenging. The second half of the semester is very interesting when you are on the topic of sociolinguistics which the professors research interest.",
                    "Easy D1 that's pretty boring.",
                    "You do not learn anything in this class. There is essentially no work so if you want an easy class, this one is great. However, it is harder to get an A+ because there are only a few assignments and they do not have a lot of questions so if you get one wrong, that's probably a whole point off of your final",
                    "Very easy class. Material isn't very hard. Great distribution class.",
                    "Fairly easy course but by the end of it you will have a basic grasp of some linguistic concepts. Not a bad D2."
                ],
                "Title": "INTRO TO STUDY OF LANGUAGE",
                "Instructor": [
                    "Taylor, Christopher M."
                ],
                "Department": "Anthropology"
            },
            "002": {
                "Term": "Spring Semester 2014",
                "CRN": "(20538)",
                "Reviews": [
                    "The course was challenging but extremely interesting, and there were many opportunities to get help on the side. The professor himself was extremely helpful, and there were also 3 TAs to provide extra office hours.",
                    "This class was easily the most interesting class I've taken at Rice. If you are at all interested in languages, I would highly recommend this class. It's not too much work, but you learn lots!",
                    "Overall a good intro course. I pass/failed and didn't attend much but mostly enjoyed the readings and work.",
                    "I wouldn't say this course was anything special. There were some interesting things, but also some boring things.",
                    "Very easy class. Go to class, do your homework, get an A without really studying for exams. Also relatively interesting material.",
                    "Pretty easy to keep up with class. Weekly homeworks, one midterm and one final. The homeworks are not extremely time consuming or frustrating and are quite fun. Linguistics is really interesting and you learn about many different aspects of linguistics in this class. Great for distribution credit or for major requirement!",
                    "Great intro class, even if you've never done anything with languages before. More work than some if you're looking for an elective though.",
                    "Easy A, really hard A+",
                    "It's really interesting and gives a great overview of many of the different options in the field of linguistics. The homework really solidifies your knowledge of what we go over in lecture, and it's just a really cool class.",
                    "This class is fantastic. It's not easy at all, it's a lot of work and the grading is pretty strict, but I learned so much from the weekly homeworks that it was worth it. Only one midterm and a final, and an extra-credit option that was pretty fun to write. In class was usually on the boring side, but the book was easy to understand. Take a lot of time on the homework because that's where most of the learning happens. If you're interested in language or just want a slightly more challenging distribution take this class! It's worth the work, you'll learn a lot",
                    "The course adequately covered all of the material in a way that made the knowledge and understanding of the material accessible in lecture. Lectures were presented in a logical manner that aided in making possibly complex topics easier to understand,",
                    "You can definitely learn a lot about the basics of linguistics, and the depth of this course is pretty suitable for both linguistics majors or non-linguistics majors. (Might be a little bit too intense for those who take it as distribution, though)",
                    "The class was organized and structured nicely. I felt it fit the right number of topics into the right amount of time.",
                    "This class is extremely interesting and definitely teaches you quite a bit. It is deceivingly tricky at times -- definitely not an \"easy A\". But if you put in the work and go to class, you will do well and learn a lot!",
                    "This class was interesting at first, but then I realized that linguistics just isn't for me.",
                    "This was a good overview of linguistics. Some units were more interesting than others. We never stayed on one unit for too long, so the particularly boring units (historical linguistics, language preservation) passed by quickly. We had nine homework assignments, the lowest of which is dropped from our grade. It is pretty difficult to get full score on the assignments without help from a TA, especially if you skipped class. The professor goes through example problems in class which is EXTREMELY valuable. Definitely try to go to class! Both exams were on Owlspace and were of fair difficulty. I'd say the worst part is having to memorize the IPA alphabet. That was horrific.",
                    "It's a pretty good course- the material's interesting and the workload isn't too bad. There's a lot of information, but nothing hugely difficult.",
                    "The class was very well organized and the material stayed interesting and relevant to the real world.",
                    "The syllabus is strictly followed. And the homework questions are perfectly selected and can even serve as notes when preparing for the tests. If you read, you understand. If you attend lecture, you understand. If you're natural with language and logic, you will understand. I'd say that the information is juicy. Good for provoking thought. And simply interesting. Not too much work at all, I'd say (or guarantee).",
                    "Fantastic DII. Very interesting subject material, especially sociolinguistics. Homework and tests are very straightforward. Very easy to well in if you attend class and do the homework.",
                    "Didn't focus on the subjects that I personally was most interested in, but the general course was fine.",
                    "This class is quite possibly the easiest class you'll ever take at Rice while still learning at least a marginal amount of new material.",
                    "This course was a very solid introduction to Linguistics. Coursework was manageable, with weekly homework assignments (about one hour max, with the lowest grade dropped), one midterm, participation points, an extra-credit report and the final. Everything tested was covered in the textbook and in the homework assignments.",
                    "I like Linguistics, so I enjoyed this course. Just make sure to go to lecture, or else!",
                    "Taking this class for D2 credit is a wonderful choice if you are the slightest bit interested in linguistics. It gives you just a feel for each aspect of the field that is covered and the assignments can be so challenging and fun.",
                    "Class is not that hard. Just go to class and do the homework.",
                    "ANTH/LING 200 was a good introductory level course. The material was very interesting and enjoyable to learn. We had roughly weekly homework assignments and reading for each class. Overall, I would recommend this course.",
                    "This class is honestly very boring until after spring break. Most of the time I could barely pay attention in class. HW takes anywhere from 1 to 4 hrs. The phonetics HW is the hardest, takes the longest, and most people do not pass. I would not reccommend this course."
                ],
                "Title": "INTRO TO STUDY OF LANGUAGE",
                "Instructor": [
                    "Englebretson, Robert E."
                ],
                "Department": "Anthropology"
            }
        },
        "201510": {
            "001": {
                "Term": "Spring Semester 2015",
                "CRN": "(20301)",
                "Reviews": [
                    "This course gave me a broad overview of language and how it functions both in society and culture. I learned more than I expected, but I wish I could have learned more structured academic information from this course.",
                    "The course is interesting. The workload was not especially tough or structured. The organization was not great- assignments were often rescheduled, classes canceled, and grades not given back.",
                    "I really love the course! So much fun!",
                    "This course had a reasonably light workload, which was perfect because it was also interesting at the same time and allowed me to take it, learning while still having the time to focus on my more difficult classes. The six homework assignments all contributed to my learning the material. The midterm was multiple choice, and the final was an essay. I learned a lot about linguistics - phonetics, phonology, morphology, syntax, discourse, sociolinguistics, and attitudes (the latter two also taught extended over an entire semester as LING 205). The most difficult part for me was phonetics and phonology as mastery of the names of sounds based on anatomical terms and the IPA transcription was more difficult.",
                    "I actually rather enjoyed this class. You learn some interesting things about linguistics and how they affect our views of individuals. It was a bit all over the place toward the end of the semester, but overall it was a good distribution.",
                    "The course was really good.",
                    "Hard for me to judge the quality of the course because I never went to class.",
                    "The class went through many interesting topics not only through formal power points but through current events and cultural references.",
                    "Excellent material",
                    "Very easy class, but only with Taylor. 5 homeworks, one test, and one 2 pg. paper. Disorganized classes, going was unnecessary. But awesome course. Easy D2.",
                    "This course was completely disorganized. I feel like I barely learned anything. Class was chaotic and most times we would barely cover any material",
                    "I love Dr. Taylor's courses. This course is a survey course covering basically everything to do with linguistics. The homeworks were easy and really helped drive the lectures home. Dr. Taylor's lectures tend to include a lot of stories, which I love. I learn really well that way. He doesn't always stick to the PowerPoint, but he does post the PowerPoints online for reference later. It's an easy course, you learn a lot (more than you realize), and CogSci and ANTH majors will use the information in their other classes.",
                    "Great intro course on linguistics. Dr. Taylor is super chill and hilarious",
                    "Basic course in linguistics. Take it if you like linguistics!",
                    "This course was very fun, as the professor always attempted to make class engaging and relevant. However, it suffered from a pretty severe lack of organization. We never actually got our midterms or the last couple of homeworks back so grades were an unknown. Sometimes homework assignments went way beyond classroom material. Overall, however, this course was not too bad. I'd recommend it with Dr. Taylor for a fun and easy D2.",
                    "you learn a little about linguistics and a lot about key and peele",
                    "This is an interesting course and is fairly easy to understand.",
                    "Not quite sure what is going on in this class. We watch a lot of Youtube videos so that's pretty cool I guess. Heard you get pretty easy A's",
                    "It's sad Taylor is leaving rice",
                    "Overall the course was pretty interesting. It seemed very applicable to everyday situations, especially the IPA and phonological parts. The class was a powerpoint lecture and had lots of interesting video and comments.",
                    "I learned a lot about language in this class. Good intro to what linguistics is.",
                    "The course was good. I felt like the first half was well-structured and was more about the structure of language. The second half was more anthropological, more about how we use language. It's an interesting distribution.",
                    "Really interesting way of approaching linguistics. I thoroughly enjoyed all of the examples that he shared with us in class. The content isn't split into distinct sections, so at times it may not feel like you're learning a lot. However, when you look back, you'll realize that you've learned quite a bit."
                ],
                "Title": "INTRO TO STUDY OF LANGUAGE",
                "Instructor": [
                    "Taylor, Christopher M."
                ],
                "Department": "Anthropology"
            },
            "003": {
                "Term": "Spring Semester 2015",
                "CRN": "(23423)",
                "Reviews": [
                    "The instructor's lectures were always interesting and insightful. I would have appreciated a few different activities in the classroom to break up the pattern of the lectures, on occasion.",
                    "Ms. Townsend is passionate about linguistics, and she is very effective as a lecturer. She made the material interesting and handled well the challenge of the coarse's breadth. I appreciated that she took the course seriously and taught us real skills. My only complaint about the course is that it was a little too easy, demanded too little, and went too slowly. Especially once the class was slowed down to accommodate student complaints, it was very hard to find the material difficult enough to be interesting. It should be noted though that I am generally disappointed in survey courses for similar reasons and am not a fan of the pass/fail attitude generally. My complaints are certainly not a popular attitude about the course.",
                    "The beginning of the course was rather boring, but the end it was more relevant and definitely more interesting. Very light course load and a good distribution!",
                    "This class is not a distribution to take if you are looking for an easy one. There are way too many subjects and fields to cover in this class making it impossible to understand with a single class on each topic. The amount of course material made the class unmanageably prioritized in my schedule. I was really disappointed in this class. Intro classes should inspire interest and all this did was crush it.",
                    "The class was one of my favorite D2's because its less abstract than other D2's. Bethany Townsend also showed a lot of enthusiasm for the subject, which was contagious throughout the class.",
                    "I learned a lot during this course! I didn't know what exactly to expect going in, but it was a very good overview of linguistics."
                ],
                "Title": "INTRO TO STUDY OF LANGUAGE",
                "Instructor": [
                    "Townsend, Bethany A."
                ],
                "Department": "Anthropology"
            },
            "002": {
                "Term": "Spring Semester 2015",
                "CRN": "(20538)",
                "Reviews": [
                    "Interesting class. Difficulty with understanding phonetics",
                    "Great and interesting course. Don't underestimate it. I'd never thought linguistics could be so extensive. But the fact that their are experts in this subject is very impressive. Tests could be uneccessarily specific and in my opinion things were graded a little to strict. So watch out and be sure to ask the teachers and TAs about anything you're unsure about.",
                    "I pass failed this class due to a heavy engineering schedule. That being said, I really wanted to do well, but didn't put in enough work to make sure that I did. I thought that making it to class would be extremely difficult given it's after lunch time slot, but the engaging conversations and importance of attendance made it an easy class to attend. My favorite conversations included a discussion of slang words in use at Rice, ambiguous headlines, and semantics (what's the difference between a couch and a sofa?). The homework seemed a bit trivial at times, but it was necessary to fully grasp the things we discussed in class. The midterms were hard. But again, I definitely didn't study enough to deserve good grades on those. Great D2",
                    "Easy class, learned a lot. Tests are EASY if you go to class and pay attention. Super light homework load. 2-3 short tests that cover the material comprehensively. Make sure you get Gibson. Very helpful and enthusiastic TA's.",
                    "This is one of those kind of disorganized classes that has a lot of open ended discussions and a broad range of material that gives insight into different linguistic fields of study. There were 2 exams and weekly homeworks, a research paper and a final. We also had maybe 2 group assignments. Pretty easy course if you're looking for a good DII. But make sure you study for the exams because although they are easy, the graders nit picked and technical terms matter!",
                    "A very interesting course.",
                    "The course was easy, and the material was pretty interesting. This course was definitely a PowerPoint class. The homework was easy and was always relevant to the material we were studying. We had weekly assignments, a project, a 7-10 page report, and a midterm + final.",
                    "This course provided a good introduction to the field of linguistics. Some of the subjects are a little dull, but you learn a lot about the mechanics behind language. It was also interesting to look at various aspects of language, including endangered languages and language acquisition. The course organization could use a little work. I do not feel we followed the syllabus for much of the semester, and we frequently jumped around in the book. We were also not told our grades on Owlspace which made it hard to keep track of our progress in the course.",
                    "Great D2. Interesting, light work load, learned a lot.",
                    "Interesting, relatively easy D2 intro class. Gives a basic intro into the different branches of linguistics.",
                    "Somewhat harder than I expected, ended up pass/failing. Interesting stuff though.",
                    "A waste of time",
                    "Only two tests and one paper the class wasn't particularly difficult. The grading was at times nitpicky but that was probably the specific TAs we had. The course didn't really follow the syllabus which was annoying.",
                    "This course was well planned out and difficult. The first part of the semester was much harder than the second part of the semester.",
                    "I have always been interested in linguistics. I was dissapointed at first by the English-centric approach which we took in the beginning, but as we got further along, we began looking at Language Universals which were fascinating. Course load was extremely light: a few easy homework assignments every now and then and a single 4-10 page essay at the end of the semester. Was overall an extremely enjoyable class and has really opened my eyes to language and provoked a lot of thought. I would definitely recommend to anyone wanting a moderately easy D2 or is interested in linguistics."
                ],
                "Title": "INTRO TO STUDY OF LANGUAGE",
                "Instructor": [
                    "Gibson, Mark A."
                ],
                "Department": "Anthropology"
            }
        },
        "201610": {
            "001": {
                "Term": "Spring Semester 2016",
                "CRN": "(20301)",
                "Reviews": [
                    "These comments are primarily in response to one comment: 1) Comments on the use of projection vs. handwriting are appreciated, but it is proven that material is better remembered when taken down by hand (which was said in class), and PowerPoint slide shows present material too quickly to allow for the accurate and complete taking of notes (which was also said in class). 2) Students were reminded multiple times that all assignments must be turned in in print (by a computer) format. Only someone who missed class multiple times would think students were notified only once. That being said, one notification is still sufficient for a responsible student. All students are also expected to read and know the syllabus. 3) Many instructors/academics spend, 6, 7, 8, or more hours on the computer a day. To spend another 2+ hours a day online grading is unacceptable, and it is a detriment to one's health. In addition, students who turn in physical copies of assignments must show up to class, and this encourages learning and participation. Electronic assignments are dispreferred since they encourage absenteeism.",
                    "Interesting and varied material, with sensible and effective combination of lectures, group work, homework and exams.",
                    "The course was very well taught. It gives a good overview of linguistics. Biweekly homeworks, two tests, and a quiz.",
                    "Some material was interesting, but way too many unmotivated definitions.",
                    "A bit of a boring subject during the first few weeks, but the latter half of the subject matter is great. Small class size.",
                    "Great choice for D2. Informative and entertaining.",
                    "Great introductory class. Good for distribution. Light workload."
                ],
                "Title": "INTRO TO STUDY OF LANGUAGE",
                "Instructor": [
                    "Henry, Timothy P."
                ],
                "Department": "Anthropology"
            },
            "003": {
                "Term": "Fall Semester 2015",
                "CRN": "(12666)",
                "Reviews": [
                    "It was interesting and well designed except there was a bit much homework for a distribution course. Also grade cutoffs were ridiculous - had to pass fail because cutoff for an A was so high and she made it clear she doesn't like to curve.",
                    "This class is simply an introductory course to the study of linguistics. The material itself was more or less a whirlwind of topics as we spent no more than a week on each unit (which in itself could be a semester’s worth of information). The homework assignments were a little bit tedious, especially for those who were planning on taking the class just for distribution, but they were very interesting and really got you engaged with thinking about the class material. The tests were pretty easy and the unexpected curve at the end really boosted everyone’s scores.",
                    "This course has high workload. There are 3 exams (in-class), homework (each week), and 2 reports. The class was harder than I expected but you will definitely learn a lot about linguistics.",
                    "The course material was quite interesting, and I learned a lot about a fascinating topic. However, I would advise against taking this course as a distribution (unless you use a pass/fail) because it is entirely too much work, and is NOT a good GPA booster. Seriously, an A started at 95, and to get an A+ required a 100%, which is just not possible. There is also no rounding, as the syllabus explicitly states: \"an 89.987 is a B+, not an A-\". The problem sets could be challenging and often tedious (Dr. Oko insisted we type up and print out our problem sets, which got pretty time-consuming when they used lots of IPA symbols like 'ʧ'). Also, the exams were nothing like the problem sets, and don't EVER miss a day in this class, because every day is important, and the lecture notes will never be posted online.",
                    "This course was much more work than I had realized for an introductory course. The homework was graded just as harshly as the tests and both were a significant portion of the grade distribution.",
                    "Ling 200 was much more difficult than I expected, and unfortunately class time did not prepare us for the homework assignments. These homework assignments would take 6+ hours each week to complete, and the final typed versions were often 7 or 8 pages in length. A lot of these assignments I felt were mainly busy work and did not supplement what we did in class. The TA's graded very harshly, and even though I attended office hours frequently, I still did poorly on many of the assignments. The class was also poorly organized, and the lectures very scattered.",
                    "This course was very poor. I went to all the lectures, but often found myself wondering why I was wasting my time there. No matter how much or little I paid attention in class/read the textbook/checked my answers with others, I would get a HW grade in the low 90s. The TAs took off for very small things. Getting an A is almost impossible, as you need a 95 with no rounding up. I feel like I would have enjoyed linguistics if the course was better, but unfortunately it was miserable.",
                    "Homeworks were not reflective of what was taught in class. They were very long and tedious and graded quite harshly. Tests were not too bad and were reflective of the study guide but still not easy, a lot of studying was required to do well.",
                    "Distribution requirements shouldn't be this hard",
                    "I really enjoyed the course material and genuinely liked what we were learning, but I do think the class is unnecessarily difficult. As an intro-level class, the expectations are unreasonably high and EVERYTHING is graded for accuracy. I've spent 8 hours on a homework assignment before, the night before I also had a 10-page paper due. Definitely start assignments as soon as you get them and go to TA office hours.",
                    "This class was far too difficult for an intro class. Had I not pass/failed the class, I would have really struggled. The graders were definitely too harsh grading the homework assignments.",
                    "Grading is very inconsistent. Class and teaching is disorganized. Oko doesn't provide students with the skills necessary to complete assignments, so students have to teach themselves most of the material. Only take this course if you have to. Ridiculous expectations for 200 level course. One of the worst classroom experiences I've ever had. Would NOT recommend. Take with any other professor besides Oko.",
                    "Really cool class and interesting material. Highly recommend for distribution credit or just for fun. Workload is manageable- 1 homework a week, 2 short reports, 3 tests. Material is usually presented effectively.",
                    "This course ended up being a lot more intensive than previous iterations had led me to believe - this was mainly because of the length of the homework assignments, which typically took around 10 hours per week. There is a lot of essential reading and discussion that needs to happen outside the classroom. The homework assignments were also graded unforgivingly, which is justified but demoralizing. It's not fun seeing a C on an assignment that you spent more time on than the classes required for your major during that week.",
                    "A lot to learn, most of them new and not common knowledge. Not an easy distribution class, you need 95 for an A. Homework questions are tricky and reading dry. Basically, everything talked about in class is based on the reading; if you didn't do the reading, it is really difficult because you cannot get much out of the lecture. The lecture is more of a practice and extension of textbook knowledge. The last chapter on language documentation is entirely based on professor's experience, relatively useless",
                    "I really did not enjoy this course. Most of class was spent going over barely relevant material in a disorganized way, making us really unprepared to complete the ridiculously long and challenging weekly homework assignments.",
                    "Lectures didn't help at all, went way off topic and no one paid attention anyway. Didn't like the group activities, they were a waste of time. Homeworks were WAY too long and we were expected to read and learn the textbook on our own. She had no idea what she was assigning."
                ],
                "Title": "INTRO TO STUDY OF LANGUAGE",
                "Instructor": [
                    "Oko, Christina W."
                ],
                "Department": "Anthropology"
            },
            "004": {
                "Term": "Fall Semester 2015",
                "CRN": "(14360)",
                "Reviews": [
                    "Fun, interesting lectures. Homework was pretty light, but the textbook was somewhat annoying. Would recommend as a good D2 class.",
                    "This course's material is very interesting, particularly if you're looking for distribution credit. The homework is helpful to apply concepts from class and prepared us well for tests.",
                    "Homework assignment due once a week that was pretty long. While class seemed to drag on some earlier in the semester, later in the semester it got more interesting. Learned a lot.",
                    "i loved this class -- it's why i'm considering being a ling major. it was very interesting and also pretty chill (i think some sections with different professors were harder than mine). the lectures were interesting and some of the homework was fun if you like word game-like stuff.",
                    "This course dramatically changed the way I think about language. We would cover a topic in class, and then I would start noticing items from the lecture taking place in conversations all around me. I learned a lot and I can't wait to learn more.",
                    "This class is interesting but does require time to do the homework and understand what is going on in class outside of class.",
                    "The homework assignments were pretty hard; they were often on material that we hadn't learned in class. But there was only about one assignment every two weeks. Interesting concepts.",
                    "I did not like this class because I thought it was tedious and boring. I found it pointless listening to a lecture about phonemes and morphemes. I took this class for a distribution credit for DII and I would not recommend. If you want an easy DII take some other class. The homework was especially tedious because you had to transcribe conversations and analyze sentences. Do not be fooled by the interesting title of this class!",
                    "There were ten homework assignments with a take-home midterm and final. The homework assignments were never too difficult, although some lacked explanation of what exactly was expected. The class is very obviously an intro level class in that it is a broad overview of many different topics in linguistics. This is good in that if you don't like a topic, you won't be stuck with it for long.",
                    "The content was varied in terms of level of interest, but the more tedious subjects were clearly things we needed to learn. Overall, the course was a great introduction to many aspects of linguistics- a field not everyone is familiar with.",
                    "This course was so refreshing and interesting. It was definitely my favorite class this semester. I had no idea what Linguistics was about before taking this course, but after completing it, I definitely want to take more classes in the field and get involved in Ling research.",
                    "ANTH 200 is definitely a LING class more than an ANTH class... but it is still interesting.",
                    "It wasn't until the end of te semester that the topics discussed began to be more interesting. The overall grade is largely dependent on the homework assignment, but sometimes to topics on the homework were discussed after it was due. The textbook is extremely dry but at times, it was the only source of reference for the homework assignments.",
                    "Dr. Niedz dropped the ball a few times in keeping the class organized as she had it on the syllabus. But I don't think it's fair to say that's entirely a flaw, because that was mainly due to her willingness to spend time answering student questions and to go off on tangents a bit to bring in other meaningful or interesting aspects of linguistics to the lecture. The homeworks initially were a little bit too long and fairly difficult, but she toned them down later, and with 10 in total it really wasn't bad. Lectures were usually pretty interesting, but she could go into stretches where it was difficult to stay focused. When she was on a roll and was able to facilitate some interaction with the class, though, it was great.",
                    "This class was kind of unorganized, but still enjoyable. There was usually a homework due every week, and they could take a pretty long amount of time, but they helped cement the material, and the professor let you drop one. Lectures were fairly interesting, but it was easy to get off topic and behind the syllabus.",
                    "I learned a lot in Ling 200. There was so much info to cover that we tended to go through it very quickly, but the homework really helped me to learn the information through it's application. The textbook was somewhat helpful, but in reality she goes over everything in class and if you're a quick learner you don't have to do all the reading. I love how homework is most of the class and we get to drop our lowest grade, and the tests have been fairly doable. She was very responsive to those who didn't have time to finish the midterm and let us take the final online which means I got to go home early!",
                    "This class was interesting at times and tedious at other times. The schedule deviated from the syllabus often, and the slides often weren't posted on time, which they needed to be because of the speed we took going over the notes.",
                    "I think the first half of this class that includes exercises and puzzles more than general discussion is more interesting than the latter half. The class was pretty unorganized, however, and we got about a month behind in the material at one point. There are a lot of misconceptions about language that are cleared up in this course, making it an informative look into pop culture through the eyes of a linguist. The class changes the way you look at the world, even if you don't love the material. I think I would have enjoyed the class more as a whole if it had been more organized.",
                    "A good survey course. The class does a good job of covering a lot of information related to linguistics."
                ],
                "Title": "INTRO TO STUDY OF LANGUAGE",
                "Instructor": [
                    "Niedzielski, Nancy A."
                ],
                "Department": "Anthropology"
            },
            "002": {
                "Term": "Spring Semester 2016",
                "CRN": "(20538)",
                "Reviews": [
                    "Great class when taken with Englebretson. Do a little, learn a lot: the ideal class.",
                    "Great course! A solid introduction to linguistics, presented enthusiastically and in a well-organized manner. Would recommend to anyone who wants to take a solid D2.",
                    "Pretty good linguistics class",
                    "Good class with really interesting material.",
                    "Course consisted of weekly modules (ungraded), 2 midterms, and 1 final. Very interesting topic presented well by the instructor. Good interesting, manageable distribution course.",
                    "This course introduces linguistics in an engaging and thought-provoking manner. My favorite of the distribution courses I've taken - the workload is not overbearing, yet I learned a lot (and even if you're not that interested in some of the material, the course moves quickly from topic to topic; I was never bored).",
                    "Very clear reading assignments and interesting lectures. Truly no complaints; this class was never too demanding and I always found the content interesting. A lot like Psych 101, in a good way!",
                    "This course was a good basic introduction to linguistics, but the lectures weren't immensely helpful. Dr. Englebretson really knew a lot about what he was talking about.",
                    "The course is very structured and builds from the bottom up, so everything you learn builds on the previous concepts. The course flow was very good because of this.",
                    "I found LING 200 to be fairly interesting. Not my favorite course ever, but certainly a good course by any metric. It is both a nice introduction to Linguistics for majors and an interesting way to spend a distribution for nonmajors.",
                    "Linguistics is an interesting subject and this class is a great introduction to the various fields dealing with linguistics. I enjoyed the class thoroughly.",
                    "A fairly easy D2. There's not much work involved outside very simple weekly modules and the three exams. If you have any interest in learning about how language works, you should consider taking this class.",
                    "Englebretson organized this course really well and there is only one assignment a week, so the workload is pretty laid back. This was a very interesting course; its cool to see how and why language is the way it is today.",
                    "This was a really solid distribution course. You cover a lot of information about Linguistics, and while there are some memorization parts that are pretty dull, a lot of the material in the course is interesting",
                    "This was a fantastic introduction to the study of linguistics, and Dr. Engelbretson is clearly very passionate about his field. Lectures were thought provoking and motivating.",
                    "You get out what you put in",
                    "This class is an easy DII. Doing well in this class depends on how well you are able to memorize the material presented.",
                    "Slightly dry but material was interesting",
                    "I enjoyed this course. I thought it was pretty easy, but I can understand how some people might have viewed certain units as difficult. There were 2 online take-home exams and an online cumulative final (all closed notes). There were 11 Modules throughout the course, each due at the end of the week. They consisted of reading a few articles or watching a video, and then a self-assessment. They were completion grades. The course was organized and Dr. E stuck to the syllabus.",
                    "You learn a lot of stuff in LING 200 without really meaning to. It's pretty intuitive stuff, so it's really interesting without being difficult to learn.",
                    "Great intro/distribution class, not heavy workload, interesting material, highly recommend",
                    "This is a really fun class! There are so many topics covered, so if you don't like one unit, it'll be done in just a couple weeks! There are modules every week that are completion grades (but doing them is definitely encouraged because it's a great way to study for the exams), two midterm exams, and a final. It's easy to do well if you go to class, pay attention, and do the weekly modules!",
                    "The subject matter for this class was interesting, but it could have been presented in a more engaging way. Workload was very light - there was a module due every week (for completion) and 2 midterms and a final. Most of the lectures were just repeats of the slides and the chapters in the book. The only difficult portion of the class is phonetics, but other than that, not too bad.",
                    "Good intro course, light workload, kinda boring even if you find linguistics interesting though just because of course format.",
                    "This was a very interesting course--I wish I'd taken it before senior year so I could've taken more linguistics electives. As an overview of linguistics, it moves quickly, but I didn't feel that any topic was particularly rushed. Topics ranged from sociolinguistics (such as the way that dialects can alter the results of trials) to phonetics. Somewhat to my surprise, the part I enjoyed most was morphology analysis; it's really cool to take 10-20 carefully chosen samples from a completely unfamiliar language, and deduce a handful of words, the basics of their grammar structure, and a set of word order requirements until you can construct new, correct sentences in that language.",
                    "This is a good distribution class. It's not too much work, but you should be prepared for a lot of memorization if you want an A.",
                    "Grading consists of two midterms, a final, and weekly completion assignments. Test questions are very fair and shouldn't be anything you haven't seen before if you keep up with the material. Interesting and straightforward course for LING majors or distribution.",
                    "The subject material is very interesting, esepcially in the lectures. The textbook could be dry/confusing, but the lectures were very clear. The class does take some work outside of class hours, since the two midterms and one final do cover material from lectures and the textbook, and students are expected to solve some \"puzzles\" for each test, but it doesn't take up too much time. Overall, a very good choice for a D2.",
                    "Class has a pretty light workload, but that can lead to neglect to study material on own time. There are not really assignments in the class, only weekly modules.",
                    "The class grade consisted of 11 homework (multiple choice, graded on a completed/uncompleted basis), two exams, and one final. The course didn't deviate much from the material in the book so it was easy to go back and reference the things we talked about.",
                    "It is a nice class with relatively workload.",
                    "Dr. E does a good job of explaining things, but sometimes it feels like it takes an hour to explain something that could be summarized in 10 minutes. The slower-pace of the course is what makes it easy to follow; just make sure you don't fall behind in the phonology sections. The book is a good resource if you don't understand something, but you really just need to understand the class material in order to do well on the tests (although the class material corresponds pretty well to chapters in Txbk). Easy B, tricky A.",
                    "The class was much more interesting than I had anticipated, I almost looked forward to doing to readings. I even found myself looking up some of the subject manner in my spare time... That still didn't motivate me to go to class most of the time, however. I felt I could learn most of the material quicker on my own and I liked my sleep.",
                    "I enjoyed this course, there was very little required work for the course and the material was very interesting.",
                    "I learned a lot of new things in this course. Very organized and the availability of the powerpoints and handouts online was very helpful.",
                    "I've never had an exposure to linguistics before, so this class was pretty interesting in my opinion. It's also an easy D2 so that's a plus. Would definitely recommend if you're at all interested in linguistics or just need distribution",
                    "The course overall was interesting, and weekly lectures were good. The modules were graded each week based on completion in Canvas, and were a good way to review the material. The exams were fair and overall the class was good.",
                    "This course is perfectly manageable if you pay attention in class and do the readings, but it gets more difficult if you fall behind.",
                    "This class is very easy to just slide by and a good choice for a pass/fail. However, I urge you to put forth an effort because the course is actually pretty fascinating and you can learn a ton from just a little bit of work.",
                    "Excellent course.",
                    "I liked this course for the most part. It got really dry at some points though. I think requiring us to memorize the IPA was a little overkill because most of us are not going to need to use this every again and it would be cooler to spend more time on things like sociolinguistics which can be applicable even if you never take another linguistics class.",
                    "This course was one of the most fun I've taken at Rice thus far. The lectures were done well; the material was nicely paced; and the course is challenging and interesting without ever feeling unfair. I highly recommend to anyone who enjoys thinking about language.",
                    "The material is very interesting. If you try at all you will do well in the course.",
                    "This class is really fun and interesting! It is a general overview of linguistics. There are two exams and weekly modules to complete and a final. None of these things are very hard and the workload is totally manageable. Even if you aren't planning to take any other linguistics classes or if you don't know anything about linguistics, this is still a great class to take.",
                    "The class can be very boring at times; I say this as a student who is still very interested in linguistics and am planning on taking upper-level linguistics courses. The class isn't impossible, though it is definitely a trickier class. Memorizing IPA is the roughest part of the year. Tests could be somewhat difficult but they were always fair.",
                    "A course which covers a lot of interesting topics particularly well. Made excellent by the fact that Englebretson is deeply invested in making sure that all students understand the material and that the course is well-organized. Highly recommended.",
                    "With Dr. E, this was a very easy course. All tests and homework are online. I think it was Dr. E's first time using canvas, and I wonder if in future semesters he will modify the course to make it more essential to come to class or to make the material more difficult (because the way it was taught this semester made class attendance unnecessary). It's somewhat interesting too! Would recommend as easy D2.",
                    "Very well structured. The class builds well, and the book is helpful."
                ],
                "Title": "INTRO TO STUDY OF LANGUAGE",
                "Instructor": [
                    "Englebretson, Robert E."
                ],
                "Department": "Anthropology"
            }
        },
        "201710": {
            "001": {
                "Term": "Spring Semester 2017",
                "CRN": "(20199)",
                "Reviews": [
                    "It was an interesting course.",
                    "alright course",
                    "The class was very organized and interesting. Jonas always encouraged participation among students and made the class fun.",
                    "The course can be interesting at times, and more dull at others. I felt that it was a very straightfoward class though if you went to lecture.",
                    "If you're even remotely interested in linguistics, there definitely is some pretty interesting material throughout this class. Makes you realize how much there is to languages that you never realized, especially learning all the stuff behind the scenes of English. Lectures were mostly systematically organized powerpoint slides with occasional sound clips/videos/documentaries. Class did tend to get a bit dry, though a contributing factor to that was the general disinterest of the class, so there was only so much the professor could do. Light homework load and you can get by without reading the textbook if you attend class.",
                    "Super interesting class!",
                    "fun, easy, really low maintenance, overall really interesting course. Super easy B, moderately easy A",
                    "This is a great intro course to Linguistics, which covered a lot of basic concepts in various fields of Linguistics. The course was not hard because we didn't dig very deep into those concepts, but it definitely serves as an effective introduction to Linguistics study and is good for non-majors who have some interest in the topic.",
                    "A good overview of all the different areas of linguistics."
                ],
                "Title": "INTRO TO STUDY OF LANGUAGE",
                "Instructor": [
                    "Wittke, Jonas"
                ],
                "Department": "Anthropology"
            },
            "002": {
                "Term": "Spring Semester 2017",
                "CRN": "(20331)",
                "Reviews": [
                    "Overall I did not find the course to be very interesting, but this was just due to disinterest of the subject matter.",
                    "Depending on your professor, LING 200 can be really great (or not, so I've heard). Achard does a great job of preparing you and teaching concepts (and presenting them in memorable ways not the same as the textbook). Definitely go to class, even if it's a lecture and technically no one will know if you miss it. LING 200 is generally an easier class, but still requires some effort. It's focused more on concepts with a little bit of technical analysis (~20%) problems. The key is doing all the modules, and remembering the details of case studies. Our class had weekly modules for a completion grade, chapter readings from the textbook, two midterms, and a final exam. You should definitely read *all* the articles and watch the videos linked on the modules, as they will come up in midterms/final even if not mentioned anywhere else, as well as do the textbook readings if you want to know what's happening. I found that class was the best for learning the analysis problems (how to identify allophones and phonemes, etc.). Overall the class is very chill, and does a brief survey of different topics covered in linguistics like phonetics, sociolinguistics, first language acquisition, pragmatics, semantics, etc.",
                    "It's a fun course, great as an introduction to linguistics. I definitely learned a lot.",
                    "This was a really fun course. The material was interesting and taught in a compelling way (even with the large class size). The weekly module was mostly for my benefit in studying for the test and was easy to complete. I would recommend this course to anyone (even if you're not particularly interested in languages) because of the engaging material.",
                    "Very interesting class, there was a lot of material to cover, and I'm pretty sure we barely scratched the surface.",
                    "Interesting subject material; the PowerPoint lecture format is not always the most engaging but a good professor helps a lot",
                    "I loved this class - it's the first one I've taken in Linguistics, and I thought the material was very interesting. Additionally, the workload was not too hard, and the weekly modules helped reinforce the material without overburdening you with respect to time. I would highly recommend this course, especially if you're interested in linguistics!",
                    "The instructor is really nice to us and know the material very well.",
                    "This course was an excellent introduction to linguistics. The weekly modules helped me keep up with the readings and are good study tools for the exams.",
                    "If you're genuinely interested in linguistics, you will learn a lot and Professor Achard is really great. If you're looking for an easy D2, you don't have to go to class & you can read over his powerpoints right before the test and you'll do well in the class.",
                    "It is an interesting class.",
                    "LING 200 isn't too demanding as a course. It serves its purpose as an introductory course. You're introduced to various fields of linguistics such as Morphology, Phonetics, Phonology, and Historical Linguistics. The only assignments you really have are the online modules that are once a week. There are 2 online midterms and a final. It's a very manageable course, and I would recommend it to anyone who shows interest in the subject.",
                    "This class is great but not as easy as you would think. You learn a lot of things and ways to think that you are probably not familiar with. Therefore, it is really important for you to go to class or at least go through the powerpoints (Prof Achard posts all of them on canvas). The phonetics stuff was honestly the most difficult for me (Making sounds with your mouth can be kinda hard if you've never tried to keep track of where your tongue is, how round your mouth is, etc). Overall, it was interesting in the end (when I actually went through the powerpoints)! The logic-puzzle stuff was fun!",
                    "Straight forward course. If you read the book or pay attention in class you will do well while learning some new things. Great D2.",
                    "A solid D2 class. Go to class and you'll do fine.",
                    "The topics of this course were interesting in general, but exams were so heavily memorization based and certain units like phonetics were just tedious to learn. There was so much material crammed into every lecture, but as an intro course, I understand that this may not be so flexible.",
                    "I felt that as an intro class this was way too technical. Did enjoy the fact that different media was used to teach the class (at times we would read the textbook, use the class presentations, read different online articles, or watch videos).",
                    "The material was always interesting and the workload was relatively light (11 completion-based modules, supplementary textbook reading). I definitely needed to study for the exams- two midterms and a final- but overall I enjoyed the course and would take another linguistics class.",
                    "Covers a wide breath of linguistics. If you have poor memory skills, spend extra time on the IPA unit. You [need] to have the IPA chart memorized.",
                    "I found the lecture material pretty boring but it was a solid distribution class to pass/fail.",
                    "LING 200 is a really interesting class. The class is quite simple, but it requires some thought to be put into it. The material is simple to understand, but the quantity can be overwhelming sometimes.",
                    "I was very surprised by this course. It made me look at language in a completely new way and challenged me to learn new skills that I wouldn't have learned otherwise.",
                    "This is not only a great option for a distribution class, but some really interesting material. It is very broad, stimulating, and not too difficult if you put the effort into paying attention in class.",
                    "While this course seems pretty easy because there isn't much work week to week, be warned that the second test is hard especially if you don't study a lot or memorize the IPA. (Hint: YOU SHOULD MEMORIZE THE IPA.) Overall it's a good introduction to linguistics and the articles/resources in the modules are always interesting and relevant.",
                    "The course goes through the basics of linguistics (as it suggests) and does a pretty good job of presenting the material in the best light it can. Get ready to learn the International Phonetic Alphabet, though, and all the different ways the mouth moves in order to make those sounds, because if you don't, you'll be lost for quite a bit later on. That being said, there was a lot of interesting things that I really enjoyed learning about, and if I were to ever build my own language, I know what to keep in mind. A great class to take as a D2.",
                    "It's a good and interesting course (especially if you need a D2).",
                    "This course is pretty easy but it is easy to push to the side and ignore until it is too late. It was somewhat difficult to pay attention because I don't particularly care for the material. Some parts were a little more interesting that others but overall somewhat of a dry course. None of this is the professors fault, however! He was actually really passionate and always tried hard to engage and help the students. Take the course but try to keep up with the material and you will be fine, especially so you're not stressing the material last minute.",
                    "The material and readings matched well and the weekly modules helped check understanding. Having said this, the lack of assignments makes it easy to fall behind and then you have to cram for tests.",
                    "xd",
                    "The lecture was very informative and I learned a lot about linguistics that I didn't know before.",
                    "I think this is probably an interesting class if you are interested in pursuing linguistics further, and I did think it was mildly interesting, I just also thought the material was very intuitive, like you could take the exam and pass even without having done anything for the class, because it's just makes sense. In that way, I didn't feel like I was necessarily learning anything new, so I wasn't that interested in it. Overall a good class if you don't want too much work, except for memorizing the IPA chart.You don't even necessarily have to go to class, and I know plenty of people who didn't.",
                    "This class was just very boring to me as a subject. I signed up for this to take an Anthropology course while getting distribution only for me to find out that it really is focused more on linguistics than anth. It's an easy class, but I never was able to engage in it so I found it very boring.",
                    "This class is a great intro for those who are interested in Linguistics and even for those who just want an interesting D2 course.",
                    "Grades are based on two midterm exams, one cumulative final exam and 11 modules (completion grade). This course is a good introduction to linguistics.",
                    "Ling 200 is an amazing course. Recommended to anyone. Language is something that isn't usually thought about on a scientific level, but it is fascinating to do so.",
                    "The material itself is very interesting but there is a lot of it presented in a short amount of time. A lot of the learning is also based on examples which are hard to remember and articulate making the material somewhat difficult to grasp.",
                    "Modules are due every Friday, you could literally submit them blank. I definitely let myself get behind because of this. Class was pretty engaging, not my favorite subject. T/TH made the lectures feel pretty long. Tests are on Canvas, not too bad.",
                    "It was a solid distribution course that actually piqued my interest in linguistics. There is so much more than learning syntax or how humans pronounce words. This class pushes you to learn, especially the IPA table, to truly understand how language works in forming society and the connections that define language interaction today.",
                    "This is a great course for distribution credit. It is fairly easy and is usually interesting.",
                    "2 exams, weekly due module test (completion credit only, so it is very easy). slides can be better organized, but overall a good intro/D2 class. Not much workload, but the class does cover a lot of things."
                ],
                "Title": "INTRO TO STUDY OF LANGUAGE",
                "Instructor": [
                    "Achard, Michel J."
                ],
                "Department": "Anthropology"
            }
        },
        "201810": {
            "001": {
                "Term": "Fall Semester 2017",
                "CRN": "(10231)",
                "Reviews": [
                    "I probably missed this class once or twice this semester but by the end of the semester almost no one showed up to class and after Harvey I know a kid who didn't even know where the class was",
                    "Just an easy course to insert in one of your busiest engineering semesters.",
                    "The course had modules every week that were online completion based and 3 exams. If you studied you did well and if you did not keep up with reading the handouts from class then you had to do some heavy catching up. The book was not helpful for me. Average class to take.",
                    "The material was not the most interesting, and I think this was mainly because it was not presented in an interesting way. The lectures were dry and the textbook was often difficult to follow, since the book was filled with lots of unnecessary information.",
                    "I expected a lot more from this course. I'm interested in linguistics but the test questions were poorly designed and took a lot away from the quality of the course.",
                    "I think the workload would've been heavier if I had kept up with the readings but it kind of felt like an unreasonable amount, especially because the handouts have all the information you were really supposed to know. The class was just three exams and weekly modules (graded for completion). Dr. Durian is not the greatest lecturer but he is very receptive to emails and I think he would probably be better one-on-one, like in office hours. The lectures consisted pretty exclusively of Dr. Durian reading off of his handouts. Answering the practice questions in class could help if you had questions but otherwise did not really feel worth it (coming from someone who actually went to class).",
                    "The course is interesting and not too stressful.",
                    "The class was easy with very little work required outside of class. All that was needed was to go to class and take notes",
                    "It's literally three exams (the final is just another midterm). And every week you have a \"module\" which you can take with other people and with notes to \"test\" your knowledge of what you should've learned from lecture/the book. Honestly, lectures felt useless as I only went to show face and tuned him out and I still did okay. If you need to take this course and the other professor is an option, take it with him bc all you will get in these lectures is him reading from his \"handouts\" and him not being able to respond to questions asked by those in the lecture.",
                    "good course, professor helps a lot",
                    "Good overview, but also lots of highly specific formatting, regional slang terms and other specifics that seemed unnecessary for an introductory class.",
                    "I thought the course was poorly designed. The discussion in class was verbatim to the handouts and readings done on the student's own time, so the class felt like a repeated session with no new information. I wish new information was presented in class that would supplement the readings.",
                    "Good D2. Chill & interesting material",
                    "Overall, I really liked the subject matter and language files (our textbook) did a really good job introducing us to linguistics. The class was not as great. The professor mostly read off of the handouts, and there were so many typos on them. He was also new this year, so he didn't exactly know how to work Canvas sometimes for our exams. I felt like I could easily learn the material on my own time with the book and the handouts.",
                    "I took this course as a graduation requirement, and as a science major, I found the class refreshing. The material taught was generally a nice introduction to the study of linguistics, and you can tell that mostly nonmajors take the course. All the information presented in class came from the textbook and/or his handouts; all of that information is covered on weekly quizzes. Three exams, including the final, count for 75% of your overall grade. Not a difficult course to take, BUT you definitely have to work in the class in order to get an A.",
                    "The course is really well structured, and there's clear continuity between the handouts you go over in class and the chapters you're learning in the book. The exams are completely reasonable if you have a decent understanding of the material. This was a great distribution class that didn't overwhelm me with work.",
                    "Content was interesting but not organized well.",
                    "The course load was about the same/maybe even lighter in comparison to my other introduction classes. The topics get more interesting as the year progresses but the textbook can be long-winded as it covers a lot of material. This course was definitely not my most intriguing class but it's a fairly easy A as long as students complete the modules and study for exams.",
                    "The lectures given in class were boring and not necessary to attend especially since the information given was simply being reviewed from the handouts given and reiterated from the chapters in the textbook.",
                    "This class was easy and interesting. Just do the modules and read the handouts and you will be fine.",
                    "The material presented in this class was interesting at times, but the way it was taught was dry and tedious. It really wasn't necessary to go to lecture because the professor read directly off of a handout that was posted online. Also, our homework was just completion so our grades were really just based off three exams. I took this class because I was interested in the topic, but I can't say I really learned much. I would not recommend taking this class unless you are really interested in linguistics.",
                    "This class was a good overview of linguistics, but the subject matter was not especially interesting. The material can be confusing at times, but the class is fairly easy, especially since we didn't have to memorize the IPA alphabet. There are three online exams covering about a third of the material each time and they were pretty easy, though they covered quite a bit of information. Attending the class is pretty pointless because the instructor just reads off the handouts that he posts online. It is necessary to read the book to do well on the exams, but the handouts cover most of the necessary information. Besides reading the book, the class is very low workload as there are just short weekly modules to complete and that's it. Class is completely lecture format and is pretty boring. It is a good introductory class to see if you are interested in linguistics or not.",
                    "The lectures are based off of handouts that Dr. Durian makes based off the textbook. You can get by with not reading the book or going to class as long as you understand everything in his handouts, which are posted on canvas. Your grade is based off of homework (completion grade), 2 exams, and a noncumulative final.",
                    "Interesting material, fun course, great D2 or just if you're interested in linguistics!",
                    "I think the course was fairly well organized. I knew what to expect on exams and what to expect going into each week. I did feel like we skipped over some important topics and we spent a long time on some less relevant/less interesting topics.",
                    "I think that this course was tedious and boring, at most. Durian did not do a good job of presenting the material, so I often found myself unable to pay attention in class, especially since he read word for word off the handouts. Some questions on tests were unreasonably specific and caused lots of disagreement amongst students. Handouts were sloppily made and had lots of mistakes that needed to be corrected/pointed out by TA's and students.",
                    "Fairly easy D2 but I didn't find the class all that interesting. Weekly completion graded hw. Lecture was pretty dry. I would suggest reading the textbook, even if you just skim it. I didn't like how some of the exam questions were impossible to answer unless you memorized the lecture notes/textbook. However, an A is definitely attainable even with these annoying questions.",
                    "Not a fan of linguistics, and put in very limited effort into this class. Still an easy D2",
                    "Ling 200 was a survey style class in linguistics. I enjoyed learning about things like phonetics, phonology, morphology and syntax, as well as socio-linguistics and language contact/change. The structure and pace of the course seemed pretty reasonable. Unfortunately, I did not enjoy Dr. Durian's teaching at all, so the class was not as good as it could have been.",
                    "Students will get out of this class exactly what they put into it. I went to every lecture and did all of the modules, and I thought it was a great introduction to linguistics. The class had a pretty light workload but I was still able to learn some cool things about the subject. Some of my classmates never attended lecture and they did not have as positive of a learning experience.",
                    "A great distribution course. Light work and easy materials. Just don't forget the weekly modules.",
                    "This class covered interesting material but could have been presented in a more appealing way",
                    "Pretty much memorization and lots of specific details. Definitely your standard intro level class",
                    "You get out of this class, what you put in to it. If you really enjoy linguistics, you can learn a lot from this class. If you are just slightly interested, you get to learn a lot in a very manageable time frame.",
                    "Lectures are just verbose, muddled repetitions of the textbook. No information is provided in lectures that cannot be found in the textbook or handouts. Read the textbook instead of going to class and you'll do better.",
                    "Easy D2, though it didn't really incentivize students to go to class and by the end of the semester, only around 25 people went to lectures",
                    "Straightforward class. One question set per week that is for a completion grade.",
                    "It was an interesting course with engaging curricula, and I enjoyed learning about the basics of language.",
                    "It was a good introduction to linguistics course with proper coverage of all the important material. It was interesting and fun. The handouts were very helpful in summarizing the material for the chapter and provided guidance for what was going to be taught in class the next day.",
                    "Most of the material in this class is easily grasped through self-study/reading the handouts and doesn't need (or get) elaboration in lecture. We had weekly modules (open note self-assessment quizzes) to complete based on the material we learned that past week, but beyond that and reading there is not much homework. Significant portions of all three exams tested us more on brute memorization and close, nitpicky reading than conceptual material, which makes the process unnecessarily tedious.",
                    "I thought this class was really interesting. Coming to class was not completely necessary because most of the lecture material was also covered in the textbook and in online handouts, but the topics were really fascinating and the workload wasn't too heavy. You do have to do a little bit every week, or else you will get overwhelmed before the test. Overall, I'd recommend to someone who wants a relatively easy/cool distribution.",
                    "The homework was difficult and involved referring to the textbook for things too specific for the notes. This would have been fine, but it made it difficult to study for the exams as it was hard to tell what was important, and what was on the homework for the hell of it. The exams were decent overall, though they did have a few questions that felt like memorization instead of actual learning. (Ex: At what age does a baby develop this very specific language feature. This is something that is easy to look up, and doesn't show any mastery of the subject, only memorization)",
                    "Class consisted of the professor reading off his handouts. Totally unnecessary.",
                    "The lecture didnt really contribute any information that we didnt already read in the handouts or textbook. However, the course was concise and helpful for an intro linguistics course.",
                    "I learned a lot of information and the class was very interesting, but the reason I didn't rate the class outstanding was because with certain topics, the professor wasn't able to effectively teach the class and left a lot of us confused",
                    "Presented the material in a very uninteresting manner. By October only 25 people or so went to class out of upwards of 150. The first half of the course was effectively equivalent to 8th grammar class. It only got interesting after we all starting skipping. Super easy though",
                    "This course is good if you want to learn the basics of linguistics. It would be good for distribution if that is what you need.",
                    "This was a standard lecture course that was a good introduction to linguistics. Everything presented in the class was in the textbook and notes, so more engaging lecture work where students could participate would have been refreshing.",
                    "Pretty good",
                    "Fun class, attendance not necessary.",
                    "The material for this course is interesting, but the presentation was kind of all over the place. There were handouts for every class, but almost all of them had problems (typos/incorrect info) that had to be fixed later. The textbook this semester changed to Language Files, which was great for some chapters and unhelpful for others. Because there was a weekly module that covered the same material as the lecture, I found it easier to just wait for the typos in the handout to be corrected than go to lecture.",
                    "The material for the course is fairly interesting. I took this course just because I thought the topic was interesting, but I don't think I would take it given what I know now. There are better intro-level D2's out there. I'm not sure how much I actually took away from this course. It's an odd mixture of very basic material, sprinkled with fairly advanced topics that are difficult to understand. I can't recommend this course.",
                    "Had to learn materials myself outside of class because the lectures were not very useful.",
                    "The class itself isn't too interesting, but this subject is pretty interesting and is more than just learning grammar as some may think. I liked the social, psychological and cultural applications, as well as the technical aspects of sound production.",
                    "The modules helped summarize the main points of each lesson, but the lectures did not seem necessary since they didn't add much to the handouts that were already provided.",
                    "This class is sometimes boring because of the nature of the subject. Even though there are some topics I find very interesting, the class quickly moves to other topics since this is an introductory class and the professor wants to cover all the topics.",
                    "This class is really hit or miss. The course material is really interesting, but a little overwhelming if you're taking this class on top of other difficult classes. The concepts are not that easy to understand and I wish I had a bit more time to actually sit down and learn the material. Every test felt like a scramble to learn what I could so I could pass.",
                    "An enjoyable course. all of the content is interesting and engaging for the most part. Class lectures tended toward repetitive, especially in the first part of the semester, as the lectures were often simply an oral presentation of the worksheets, which were condensed overviews of the reading chapters (and sometimes indistinguishable from the practice chapters in the reading itself). However this could be an advantage as it reinforced the content of the course.",
                    "Personally, the course was not extremely interesting, but it was organized and the workload was manageable.",
                    "Chill course. Very little work and I honestly never went to class after the first month of school. Nice D2",
                    "While there was some topics that were very interesting to learn and understand, other topics were a bit too vague. On a few occasions when presenting a student would ask why a question he was answering couldn't have a different answer and sometimes he would agree that it might be both depending on how you look at it. Moments like these left some of us very confused.",
                    "Pretty good class, not much work required, still learn a lot",
                    "This was a rough semester for me so I'm sure I would have appreciated the material a lot more if I had actually gone to class... It is set up essentially so that you don't need to as long as you do the work outside of class a few days before the test.",
                    "The workload in this class was very manageable. It was an excellent introduction to linguistics.",
                    "boring",
                    "A good class, wish lectures were a bit more helpful. Generally lecture involved reading off handouts (summaries from the textbook usually). Not super difficult if you do the textbook readings, handout readings, and do practice problems before the exams.",
                    "This class was a decent introduction to linguistics, though the material felt dry at times. The lecturer was not much help, but the workload and exams were very manageable. Definitely worth taking overall.",
                    "Try to do the readings and kind of pay attention, so studying for the exams is easier for you. Maybe not the most interesting subject, but even if you no liek, its pretty easy",
                    "Modules were mostly tedious for a university level course.",
                    "This class covered awesome material but was taught poorly. Lecture consisted of Durian going over handouts that contained the essence of the required reading, line by line. At first, I thought he'd use the handouts as supplement to his slides or verbal lecture, but don't expect much of that. Weekly completion modules, two midterms, and a final. I stopped going to lecture to do the readings at my own accord (lecture contributed this little) and found I performed better.",
                    "I managed to get through this class without learning a single bit of linguistics. That's entirely my fault, but it kinda feels like it was easier than it should have been to just never go to class, never study, and still pass.",
                    "The class was fairly easy as long as you read the textbooks and handouts and did the modules.",
                    "Not a very difficult class, but the presentation of the material was dull.",
                    "The textbook is like 800 pages but only 17 of those need to exist.",
                    "with durian it is pretty easy. No one attends classes, but you can easily get an A by not attending. Just do good on the canvas take home exams (there are 3 of them) and do all the modules",
                    "Here's the thing: this class the quintessential one you hear about in high school where they tell you \"In college you have to learn everything by yourself\". The material of the class is interesting (to me) but going to the actual lecture usually doesn't add much to your experience. Durian is a very knowledgeable guy, but he uses the same examples over and over again (baeg, shtrong, and many other ones that EVERYONE noticed were being said ALL THE TIME which was actually quite funny tbh). He does his best to make the class interesting, but all the material you need to pass is made available to you outside class in the textbook and the handouts. Organization was well-done and consistent, but getting myself out of bed to go to class was a bit of a struggle. All that being said, I'd recommend the class because the material itself is interesting and challenging but presented in a manageable way in the handouts.",
                    "This was a good class to take in getting an understanding of what linguistics is and the different fields that exist within the subject. The class itself can get a bit slow, especially because a lot of it is just reading off the handouts that are given already. The exams are all take-home and online, and they're not super difficult, but there aren't enough practice questions. The modules that are required each week are alright, supplemented with extra videos and articles. Overall an okay class, though you may find the classes themselves boring from time to time.",
                    "The class is very textbook based",
                    "Prof. Durian read from straight from handouts in class and frequently confused students. Could not answer questions in a straight forward way and often backtracked. Most students did not go to his class after the first tests because they were not helpful to understanding the material.",
                    "Awful, under-stimulating waste.",
                    "I took this class because I heard that it was an easy distribution credit. Turns out, it is. But also, it was an interesting class and I feel like I learned a lot of interesting information that I otherwise would never have learned as a person who sticks to STEM classes most of the time. Would recommend.",
                    "Very boring lectures, but easy to follow and do well."
                ],
                "Title": "INTRO TO STUDY OF LANGUAGE",
                "Instructor": [
                    "Durian, David C."
                ],
                "Department": "Anthropology"
            },
            "002": {
                "Term": "Spring Semester 2018",
                "CRN": "(20331)",
                "Reviews": [
                    "If you love to study language, this will probably be a class you enjoy. I recommend not waiting until 4pm on Friday to do the modules, even though they are a completion grade.",
                    "As long as you read the chapter and do the practice problems when you are supposed to, you will do well.",
                    "Very easy D2 if you want it to be. Completion credit canvas quizzes due Friday at 5PM worth 25% of your overall grade. 3 Canvas exams each worth 25%.",
                    "A good basic overview to linguistics if you're interested in the subject. Light workload and interesting material.",
                    "Went through a lot of content very quickly. Unfortunately relied on occasional busy work at the end of each week.",
                    "The course is interesting and relevant to our lives.",
                    "This course had a very light load. We had completion homeworks of 20 multiple choice questions due once a week, which were 25% of the grade. Then we had three exams, which were also each 25%. So if you did all the homeworks on time it was the same as a 100 on one of four exams. The exams themselves were pretty easy, mainly just memorization of the terms given on the study guides. Overall, I didn't learn a ton, but it's a good distribution if you're looking to boost your GPA.",
                    "I really liked how engaging Dr. Durian was through Canvas. He was very prompt and specific with his assignments, and there were consistent modules to be done on Canvas that made me accountable for the readings I had to do. I especially enjoyed the articles in the modules, there were topics I had no idea of. I learned a lot from the course- it is definitely frontloaded, so make sure you study the IPA well from the beginning of the course, so you only have to revisit it as the course progresses. It will come back again in the course.",
                    "A reverse classroom approach would suit this course very, very well. Too much lecturing, not enough active learning.",
                    "This is a fairly basic introduction to linguistics, which was pretty interesting. It's mostly memorization, but there's some problem solving as well.",
                    "This course is fun but not too challenging.",
                    "It's okay... not very interesting material tho.",
                    "Thought the course material is pretty interesting, the course itself is just structure liked a barebones PowerPoint memorization class. I feel like it could have been a lot more interactive and engaging, but it just wasn't worth going to class when I could read on my own time and get the same amount of \"learning\" out of it.",
                    "I really like this class and would recommend it to anyone who wants to explore linguistics (even just a little). I was a junior and I wished I had taken it earlier. The content was new and interesting to me, and I learned so much about different aspects in linguistics, including language construction and acquisition. The course structure is clearly stated in the syllabus - do make sure you remember to complete the weekly modules, though. If you go to the class, it should not take you much time outside of the classroom to study. In overall, the course is organized well. The last 1/3 of the semester was a little confusing since the professor did not go through every problem in the handouts with us.",
                    "It was an interesting course as an elective",
                    "Ling lectures are pretty boring, but it is still helpful to attend them. The modules are not very time consuming and the readings in the textbook are not really necessary either.",
                    "Pretty decent class. Would recommend for elective course.",
                    "Easy and informative. If you are looking for a D2, Ling200 is the one to go.",
                    "The powerpoints and handouts were very helpful",
                    "A good D2 elective to take.",
                    "A lot of memorization. I can't speak to the experience of learning under anyone but Durian but the way the class was laid out was just a regurgitation of the material in the powerpoints. Exams were on those and material from the book.This is definitely a LING class over an ANTH class, if that's what you're looking for.",
                    "The class was fairly easy, most people didn't even show up to lecture. I found that going to the lecture helped my understanding of the material even if the slides were posted online. Some test questions were over lecture-specific material (like videos that we watched) so going to lecture probably helped my grade.",
                    "This class is very confusing because most people don't go to lecture, and it seems pretty easy, but I always found the exams to be very detailed and somewhat confusing. Overall, going to class really helps because there's things on the exams that aren't in the textbook.",
                    "With Dr. Durian, this course was less than stellar in the way material was organized and the explanations given for the material.",
                    "Good course",
                    "The course covered a wide variety of linguistics topics, but none of them in depth. It's a \"sampler\" linguistics course. Overall, the class was well organized and the workload wasn't bad; there is a Canvas module consisting of a couple articles and a quiz to be completed every Friday and three exams, all on Canvas. Overall, I found the material interesting, and the class is a good intro to linguistics and D2 credit.",
                    "The syllabus is very detailed and straightforward, so you'll know what's going on from the beginning. However, this course was not as interesting as I thought it would be. Not many people showed up to lectures; very few students were actively learning during class. Also, the grading of the exams was very harsh.",
                    "It was an interesting course, and the powerpoints are useful.",
                    "The idea of the class was very interesting to me, but the way that we went about learning it was not very engaging.",
                    "The only homework was these modules at the end of each week. They definitely helped with the concepts we were learning.",
                    "Linguistics is an interesting field. The course is an overview of the several subsections of linguistics and how they are applied to our everyday use of language. The course is not insanely hard, you will learn as much as you want to learn. Don't forget to complete the weekly modules as they are a big part of the final grade.",
                    "Dr. Durian is cool, pay attention to examples in lecture because while he does put his slides on Canvas, the sets done in class are definitely tested and it will be harder for you if you start to skip (a lot of people end up doing it towards the end of the semester)",
                    "Good class with a lot of material covered.",
                    "Straight-forward and well-organized course",
                    "This class is so boring even though I never went. I hate linguistics.",
                    "I would have enjoyed the course so much more if the lectures were interesting. Definitely not as easy as I expected.",
                    "The only homework is a participation grade.",
                    "If you're a visual learner, you basically don't have to come to class until about a month in, because it's basically just Dr. Durian reading off the slides (which he posts to Canvas). After that, though, you should start showing up, because there are videos he shows that you won't be able to see anywhere else and that will show up on the exams. Good intro to lots of different facets of linguistics. Language and the Brain week is rough if you're squeamish.",
                    "I found it extremely hard to motivate myself to come to class because the material was already on Canvas and lectures seemed like they didn't provide much more than what was on the slide. If you are interested in linguistics, this will be a fun course for you, and I have learned a lot, but I found out fairly quickly that since it is an introductory course, you'll briefly go over a broad range of topics that you may or may not be intrigued by. The material is very simple to grasp and I found that studying for an exam took less than an hour, sitting with the study guide and the textbook the night before the exam. The odd due date of the weekly modules (5pm on a Friday, despite class being on Tues and Thurs) meant that I missed 3 modules out of 13, but since they're weighted at 25%, it dented my grade more harshly than I think is appropriate. Good course, not fantastic."
                ],
                "Title": "INTRO TO STUDY OF LANGUAGE",
                "Instructor": [
                    "Durian, David C."
                ],
                "Department": "Anthropology"
            }
        },
        "201910": {
            "003": {
                "Term": "Fall Semester 2018",
                "CRN": "(13712)",
                "Reviews": [
                    "It was extremely interesting for me, I just struggle to pay attention for long amounts of time.",
                    "It was difficult for me to stay engaged for 1.5 hours. Some of the content was interesting but there was a lot of information presented during each class, making it slightly overwhelming. The content itself was easy to understand though, as long as you pay attention.",
                    "I enjoyed the class, however, I did drop it because the exams are extremely hard.",
                    "This course is interesting and teaches a lot about many different aspects of linguistics. I think that it gives students a good base on what linguistics is, and it's easy to see if you are interested in the topic after taking this class or not.",
                    "Good organized course that covered everything I wanted to learn about language and linguistics even though I didn't know I wanted to learn about it.",
                    "Fun class, interesting topics",
                    "Honestly, I was taking this for an easy distribution but it was not actually easy. Only halfway through taking the course did I learn that my friends also did not think it was that easy. Look, you don't have to go to class (it's really early and long in the morning) and there aren't a lot of assignments to do (only a pretty straightforward each week), but the actual material is pretty intense. There is a LOT to memorize. The first midterm was easy. But the second one will tank you if you aren't taking the course seriously. It's also not as straightforward as just rote memorization. You need to develop this like linguistic instinct by the second midterm. So all in all, it's not that easy of a course.",
                    "This is some very interesting stuff if you go to class, unlike me. Don’t be me. Then you cram for the exam and do bad, but the material isn’t terrible. Just do your modules and don’t procrastinate them and the exams. Ask him for help too.",
                    "The course can be boring in the lecture format and there is a lot of information being thrown at you. However, the course is designed so that everything fits together and one understands the larger concepts well. There is a good amount of memorization though.",
                    "The course was super intriguing and fun to learn about the intricacies of language. I would definitely recommend it.",
                    "This course was a well-taught foray into the world of linguistics.",
                    "The lecture is a little mundane, but the professor is very passionate about the subject and makes the class slightly more bearable.",
                    "Overall the course was structured very poorly. The professor simply reads from the lecture slides. Personally, the material was interesting, but the class was not as interactive and engaging as I wanted it to be.",
                    "I originally took this course as an elective but I ended up finding it so interesting that I switched my major. This is a very interesting class and if you are interested in language at all you should take it!!",
                    "This is not as easy as people will tell you it is. Phonetics.",
                    "Somewhat dull class without much focus or progression. Organized well",
                    "Great class! If you are looking for distribution credit or interested in linguistics, I would recommend this class.",
                    "A great D2! Learned a lot through the course and it was super interesting with not too much workload",
                    "Linguistics is a fun subject, and this introductory-level course really got me interested in taking another one next semester. The modules helped, especially if you don't do additional studying, though for the final exam I would definitely not rely just on the modules. Take good notes and read the textbook! The modules are fun, good reviews, and they don't take a lot of time. The exams are also take-home, so another plus. I had a good experience and it was honestly really chill.",
                    "Class got more difficult as semester went on. Not too much work, just 2 midterms and a final along with weekly short online homeworks to make up the grade.",
                    "Achard is a great professor who's really passionate about the subject. However, Linguistics just wasn't interesting to me so having to memorize a lot of the content was annoying and tedious.",
                    "This course covers a wide variety of linguistic topics, and I really enjoyed it. It is not necessary to show up to every lecture, but the content is super interesting and Dr. Achard was an outstanding professor.",
                    "Dr. Achard is an amazing professor and the way he teaches Ling 200 covers just the right amount of breadth, makes you excited to learn even I am an engineering major and teaches you so much about language.",
                    "The weekly modules were nice, but I wish there were more supplementary materials to practice with outside of class.",
                    "This course is a good standard introduction to Linguistics. Since it's such a large course, it can be difficult to feel motivated to attend class consistently.",
                    "I really enjoyed this class. There is a lot of material presented, but the material is not difficult. I found all the topics really interesting. This is a great distribution class to take. It helped me broaden my general knowledge which is exactly what a distribution class is supposed to do. I think the breadth of the material is also adequate for a linguistic introduction course and should give you a good idea of the world of linguistics. There were 2 tests and a final exam. There were 11 modules that we due almost every week; these were not difficult and were meant to keep you on track in the class. Overall, I highly suggest taking this class. It was a very fun and interesting learning experience.",
                    "I would have gone to lecture more often if it wasn't a 9:25 :) Honestly the material is interesting and Dr. Achard is great. Really focus on the slides for the exams!!",
                    "This is a great course. (I recommend the larger seminar). Covers a broad range of topics within the linguistics field. If you are curious about the linguistics major do not hesitate. Not too much work outside of class, and the tests are not challenging if you keep up with all the homework. Better to attend class but the lectures are online as well.",
                    "The course was extremely interesting and well taught! The workload is light, and all of the assigned readings/videos are enjoyable. The lectures are engaging and packed with information, so attending lecture is helpful. The course starts from the basics and works its way up, so it's really for anyone with an interest in linguistics. Overall it was an outstanding course, and I definitely recommend taking it!",
                    "I loved how the lectures was extremely engaging AND they aligned with the textbook material which was incredibly helpful throughout the class. Also the professor is great!",
                    "I personally struggled in linguistics, but it was a great course nonetheless. 2 midterms, 1 cumulative final, and weekly modules that require a passing grade. Achard is an excellent teacher for linguistics. A really good class but maybe not as easy as many expect it to be.",
                    "The weekly modules don't take more than 30 minutes to an hour to complete. However, the exams have a lot of material covered on them and so you do have to study quite a bit for them. Lectures are very important as he covers all the information on the three take home exams. I would not say this class is the easiest A for a distribution.",
                    "Pretty interesting class, not too much work. Definitely worth taking if you need distribution credit and are interested in language!",
                    "I really enjoyed LING 200! It gave a great overview of various linguistic fields, including pragmatics, semantics, morphology, phonology, phonetics, syntax, sociolinguistics, language acquisition, language development and endangerment. Each week we had a short \"module\" that included a couple articles to read, sometimes a short video, and a 20ish multiple choice quiz that reinforced the concepts we covered that week (we only needed a 70% to get credit for the modules, so they were v chill). There were 2 midterms and one final, all three of which were take home and quite doable. I found the phonology unit a bit boring, since it involved a lot of memorization, but other than that, the class was pretty interesting! It involved more logic/puzzley stuff than I expected because we would analyze sets of words in foreign languages to determine sound or meaning patterns (kind of like a puzzle, so I found that fun). Also, the sociolinguistics, language acquisition, and language endangerment units were pretty cool, and much more similar to topics you would see in a psych or soci class. Overall, pretty good course!!",
                    "I thought this course was very interesting and I enjoyed it a lot, but sometimes went a little too fast.",
                    "This course is very interesting but it does require a fair bit of memorization. I didn't have the time to invest in this class this semester, but I still enjoyed the lectures. The articles we had to read for modules and videos we had to watch were pretty cool",
                    "This class is just dumb. Like the presentation of the material was good, but the material itself was stupid.",
                    "Overall, very good course. Definitely not as easy as most intro D2's, but the material itself is really engaging. Go to lecture, study reasonably for the exams, and you'll definitely be able to do well.",
                    "The course was interesting and had a lot of material to go over. That being said, if you want to do well on exams, you have to do some self-learning. Some material is covered on the weekly modules on Canvas, but not all of it.",
                    "Good class to take for a DII! Interesting material as well!",
                    "Material is super boring. The book is even more boring. I wouldn’t take it if you’re looking for a laid back class",
                    "The instructor of this course selected great novels to read throughout the semester, fostered fun discussions, and returned essays with copious feedback.",
                    "Indubitably, Ling 200 with Achard is a great class. The material is interesting and the workload is reasonable. If you study for the midterms, you'll do fine. Try to go to class, because Achard is a great lecturer, but honestly, just reviewing the slides should set you up well for the exams. Do you modules and spend some time with the material. If you treat this semi-seriously, you'll gain a lot out of the class, learn about the nuances of English and languages, and not have too hard of a time.",
                    "This course makes me have a better understanding of how to scientifically study a language from various aspects. In addition, I also learn the historical development of languages and their cultural importance.",
                    "Should have been easy class, but for some reason, it was really hard. Halfway through the semester, I realized how cool this class could be, but probably just because I was taking a heavier courseload, this class seemed to have a lot of material (especially memorizing the IPA table).",
                    "This class wasn't extremely challenging: tests are take home and there was one homework assignment per week. Personally just felt the material and presentations were a little monotonous.",
                    "This course was super interesting even if you know nothing about language.",
                    "Ling 200 was a great course. I found all the information super interesting. We had 11 modules as homework and then had 2 midterms and a final. We had a ton of different units that would build up on the other and it was cool to see how language comes about. This course was super interesting and pretty chill for a D2. I recommend it if language and whatnot interests you.",
                    "The course is very straightforward. The modules and textbook provided me with all the necessary tools to succeed in the class (which means that going to class isn't really necessary). Nonetheless, I learned so much and I highly recommend this course for a D2.",
                    "This class was interesting towards the beginning, but would always end up losing me half-way through. You can tell the instructor has a passion for this, which shows during his presentation, however, it was a lot of reading off the slides which was not interesting at all. We went through information pretty quickly, but the professor uploads the slides which is extremely helpful as there is never enough time to write/type it all down. On that note, if you miss lectures you will not be lost because he uploads the notes and that is exactly what he reads during the lecture.",
                    "I thought the class was pretty boring not going to lie. The lectures are very long and boring. If you are into linguistics you might enjoy it, but it was not my thing.",
                    "Memorizing stuff can get dry. But case studies of obscure languages and analyzing universal patterns are pretty fun. And bonus: now you can read the dictionary pronunciations with the weird upside down or slashed letters",
                    "Best-organized class I took at Rice this semester. Very well thought out slides and excellent presentation of the material. Convinced me to take another Linguistics class next semester!",
                    "I did not find this course particularly interesting. It is not super challenging but I rarely found myself super engaged. It was hard to focus in class and there was just a lot of memorization. All the exams are take home and you have to complete weekly modules that are graded based on completion. I think there are more interesting D2 distribution courses you can take, but if you are looking for an introduction to linguistics it's not a bad course. It helped me realize I don't want to pursue linguistics but I think it could be interesting to some people.",
                    "Interesting course material esp if you like studying foreign languages!",
                    "Would highly recommend this class. The workload is incredibly light (one homework assignment a week) and all of the exam material is covered in class (also exams aren't bad, mostly multiple choice and short answer). Go to class and pay attention and you'll do well, but if you miss a lecture the notes are published. Material is dry but Dr. Achard makes it interesting (and it is actually pretty cool stuff too).",
                    "A well-organized and executed introductory linguistic course. A little bit memorization is required for the concepts, but otherwise the workload is pretty light. It's a great distribution course and an introduction to linguistics.",
                    "This is a great course, although it is harder than I expected it to be. You do have to put in effort to make a good grade, but if you're pass-failing it's very little work. An interesting D2.",
                    "Course was pretty easy, material wasn't really my thing but could be interesting for other people. Lectures can be useful but also not required, because all the info is on the powerpoints.",
                    "LING 200 is an incredibly interesting course if you are willing to learn. Achard made it to where class participation was essential, and his assignments as great ways to study for exams. However, the textbook was pretty dry, and while some participated in the class, that excitement did not go all the way to the back of the classroom. In addition to that, the material was often rushed to the point where it was difficult to take notes. I understand that there was a lot of material to get through, but if we took more time to discuss and fully understand the slides, I feel like there would have been a better outcome.",
                    "Super chill class for distribution. All assignments and exams are on canvas which is nice. Slides and some articles are all you need for the class and prof shares both. As long as you do a bit of work, class is a decently easy A",
                    "This course allowed me to better understand a field of knowledge I was not previously familiar with. It was very interesting and offered something for most majors",
                    "This has been a really interesting course. All of the topics are really fun to learn about, and since most of the material is probably pretty new to most students, it is really engaging even if it is not so advanced.",
                    "This was an interesting course because it teaches you to view language from a very different perspective. I'm a very STEM-oriented person, so this course helped me step out of my STEM bubble and look at language differently.",
                    "A good class to take if you are looking for D2 credit. The material is interesting and the workload is pretty light.",
                    "Not a great class to take. Class is boring to me, and I did find the subject to be interesting. I felt like I wasted too much time on this course learning coursework for no reason. I took this class for a class distribution, and I am disappointed that I even took this class. Would not recommend to anyone.",
                    "LING 200, being an intro class, covers an extreme broad range of topics. Unfortunately, it seems like because the material need to be known is so broad, none of the material seems interesting to me and it seems like a whirlwind of stuff to memorize. Memorize definitions of specific linguistics terms, memorize the phonetic alphabet, memorize the stages of how babies learn to talk... it just seems like so much memorization. There are some more interactive parts of the class like constructing sentences given a couple sentences in English and another language, but the majority of the class seems like memorization. Also, if you are taking this class in Herring 100, the room smells like the inside of an airplane or really bad perfume. I would only recommend this class if you like or already know you are interested in studying linguistics, and I would take something else if you need distribution 2 credit."
                ],
                "Title": "INTRO TO STUDY OF LANGUAGE",
                "Instructor": [
                    "Achard, Michel J."
                ],
                "Department": "Anthropology"
            },
            "002": {
                "Term": "Spring Semester 2019",
                "CRN": "(20331)",
                "Reviews": [
                    "The structure of the course is very clear and the expectation is reasonable",
                    "The lectures were consistent in quality throughout the course up until the final day of class. The lectures are simple to understand and do not require intense critical thinking, I took this course as a distribution and was able to maintain a high A the whole course without stressing about it at all. There is a weekly homework assignment that does not take more than 2 hours to do, there are frequent TA office hours that are always helpful, the lectures are all the materials necessary for completing the homework assignments to completion.",
                    "I found this class pretty interesting. We had 8 homework assignments which makes up most of your grade, and we also had two exams and weekly pop quizzes. You only have to get 80% correct on all of the quizzes to get full credit and they help make sure that you look through your notes, so you don't have to study a lot right before an exam. In terms of content, I thought the information got a lot more interesting towards the end of the semester when we learned about historical linguistics and language revitalization. Also, this is a great class to take with Cognitive Psychology because I found a lot of overlap with the content, especially with Language Development.",
                    "It's your typical intro class with tons of people just taking it for Dist. req.",
                    "This course is a very good course. Lectures cover all basic knowledge of linguistic and are well-made. We have quiz every week to improve our learning. The workload is not too heavy. There are several homeworks across the semester and 2 exams. TAs and instructor have office hours every week so we can ask questions about homework or lecture.",
                    "Overall, the course provides a good basic overview to the field of linguistics and communication. The class deals with topics such as dialect, language development, and basic phonetics.",
                    "It was a well structured course",
                    "The material is important for a good foundation in linguistics.",
                    "This is a great distribution class: it's interesting and you'll learn a lot, but it doesn't take an inordinate amount of time on a weekly basis.",
                    "Standard intro lecture style class, presentation of material was a little dry. Some really interesting material - I enjoyed the concepts a lot.",
                    "Pretty manageable class! Many people skip or don't pay attention, but it really helps when studying for the one midterm and final if you pay attention. Go to TA hours to get 100% on the homework–it is 48% percent of your grade so it helps. You can take the test remotely which is also nice and less stressful. I really enjoyed but sometimes it got a little dry. I am an engineer and it was very easy to balance this course.",
                    "This class could get a little monotonous since it was mostly just going through the lecture slides. It's a really manageable distribution class though, with just two tests (including the final) and about 10 homework assignments in addition to some pop quizzes which were essentially just to check attendance.",
                    "This class had the potential to be interesting but lectures were very dry and hard to engage in.",
                    "Overall I think this was a great overview of the field of linguistics. I personally did not find the first part of the course (phonetics, phonology, morphology) to be that interesting but the second part was very interesting to me. I enjoyed talking about syntax, sociolinguistics, historical linguistics, and psycholinguistics. The homeworks are very helpful to practice the concepts learned in class and the frequent quizzes are good to make sure you don't fall behind in the work and since they are curved, they do not affect your grade too much. In the end, it is a very manageable class that is interesting as well",
                    "Random attendance quizzes were annoying, but overall material is interesting, workload is light with semi-weekly fairly short homework assignments, only 2 exams (midterm and final).",
                    "This is a pretty solid introductory course.",
                    "This was a genuinely interesting course and I'm glad I got to get my feet wet. The way it was taught made a lot of sense and let you connect ideas from previous units to explain different aspects of language. I definitely feel like I am more conscious of my use of language and differences in language in general, and I am very grateful for the way this class has expanded my worldview.",
                    "The class is made up solely of lectures from powerpoints. The only thing that incentivizes you to go to class is one question pop quizzes he gives at the beginning of class. The homework is easy and you can check your answers with the TA. Overall, easy distribution class.",
                    "Course is very well organized, as Dr. Manker creates good lecture slides and the course assignments follow closely to what he teaches. Homework assignments, weekly pop quizzes, midterm, and cumulative final which is a little unfortunate because it's a lot of material and heavy on the memorization",
                    "This is a good introduction to the different areas of linguistics, but as far as interesting D2s go, it wouldn't be my first pick. In other words, if you think you might be into ling as a potential major, I'd definitely recommend it, but if you're just looking for a cool D2, this might not be it. Lectures were standard powerpoint slides each day, and we had about 8 homeworks throughout the semester (which we could check with others in the class). So the workload is very manageable, the class material itself just often felt dull in the way it was presented.",
                    "love this class! really interesting, homeworks were easy and class is easy A",
                    "The course covered a very interesting topic, however, if you are not interested in linguistics I would not recommend this course. It is structured as only a lecture and there are some interactive activities but not very many.",
                    "I think the course was a good introduction to linguistics (covered many different aspects) and gave me insight into the importance of lingustics",
                    "Great D2, not busy, and perfect for those who are even vaguely interested in a broader view of language as a social science.",
                    "It's an okay class. Not a lot of work at all. Occasional homeworks an easy tests. The only thing is that the class is not interesting at all. You don't even really need to go to class because everything is in the powerpoints. Im taking this class because there are some higher level english classes that really interest me and this is a pre-req. I still fully expect to be interested in the higher level ling classes (i've already taken 325 and loved it) but this class is mind-numbingly boring. riprip",
                    "Lessons were easy to understand an follow. Class was interactive.",
                    "Class was mostly just Dr. Manker reading off the slides. Don't buy the book because the slides are basically the book word-for-word.",
                    "Really good class for distribution credit.",
                    "It was standard basic linguistics and it covers a lot of general topics. Could have been way more interesting. A little disappointed.",
                    "Homework assignments are fairly easy. 2 exams are worth almost half of your grade, so definitely do not wait last minute to study for them. Overall, I learned a lot from this class and would recommend to anyone looking for a D2 or elective.",
                    "interesting class"
                ],
                "Title": "INTRO TO STUDY OF LANGUAGE",
                "Instructor": [
                    "Manker, Jonathan"
                ],
                "Department": "Anthropology"
            }
        },
        "202010": {
            "001": {
                "Term": "Fall Semester 2019",
                "CRN": "(12791)",
                "Reviews": [
                    "We learned about linguistics on many different levels including on the level of sentences, words, morphemes, and sounds. There are quizzes in class to help solidify the concepts, and they usually are not overly difficult. Towards the end of the class we covered historical linguistics, language acquisition, psycholinguistics, and language restoration. I found the class to be interesting. Professor Manker also uploaded the slides as an additional resource to help study.",
                    "The course was well organized, and I thought that the homework assignments were interesting and a key factor in my learning.",
                    "Covers a lot of material but not very in depth. A good and interesting intro class for Linguistics.",
                    "A good introduction to the study of language.",
                    "This class was really interesting and I especially learned the most from the homework’s. I enjoyed the material and we had a lot of homework’s but they were very doable and I enjoyed doing them! There was only one midterm and a final and they were both straightforward and challenging but only in the best way. A good class overall",
                    "1 midterm, 1 final, 8 homework assignments, and pop quizzes in class for attendance. Not a heavy workload, and interesting material if you are looking for an easy D2",
                    "A little heavier than I thought it would be, since I was just taking it for distribution, but it’s definitely doable if you put the word in!",
                    "I really enjoyed this course. I was most interested in the material we covered towards the end which meant it was a little rushed. I wished we had gone more quickly through someone the topics covered in the beginning so we could have spent longer on the more complex topics. The work overall was pretty light. One homework every other week, a midterm, and a final exam. There were also one question pop quizzes given in the first five minutes of class. they were meant to gauge participation/attendance but you only got the credit if you answered it correctly not just if you were there to answer it. Most of the time this was not an issue but occasionally the questions would be something really hard and it felt bad to be regularly attending class and not getting the points for it.",
                    "LING 200 is a great distribution 2 course. Workload is not heavy & it's more interesting than you'd expect.",
                    "good course, easy to follow, typical format for college class",
                    "This course provides a nice preview into linguistics. The class is organized very effectively with lectures available to all students. The homework also prepares students very well for the exams, and the quizzes serve as an effective way to make students review the material after lectures.",
                    "As an engineering major, it was refreshing to take a course that wasn't computation based. The lectures are extensive and there's a lot of information, but the course itself is great.",
                    "The course is organized logically and is perfect for someone with no experience in linguistics. Each concept builds off of a previous one, and I found the course itself pretty fascinating. I like the lectures, and the homework is actually pretty fun.",
                    "The material was interesting at times, especially the first unit(phonetics), but after that, I really did not care because the professor was really boring, so I was either on my phone or asleep in class. If you need a D2 don't take this class because it's really boring and a lot of the material is not intuitive.",
                    "It can be hard focusing in the lecture since it's so long and there is so much information. However, you can always go back to the slides and learn the information.",
                    "It was alright. The professor mostly teaches from the slides which is boring but also makes it easy to catch up if you've been gone, and if you need to study for an exam.",
                    "This course was interesting but slightly dry",
                    "The material was incredibly interesting and was my favorite class of the semester, even though I'm not a linguistics major.",
                    "Solid distribution course in an area that probably you’ve never taken a class in, although certain subjects can be a little boring.",
                    "This class is fairly easy compared to STEM classes and definitely much less work. The grade is made up of 8 homework assignments, a midterm, a final, and short pop quizzes that cover the material from the previous lecture. The homework assignments and exams are very straightforward and not very challenging. The pop quizzes are a good way to force students to review their notes consistently. All around, this class is an easy D2.",
                    "The class provides a well-rounded understanding of basic linguistics concepts without being very demanding. The homework assignments were not the cause for any concern.",
                    "I took this course for D2 credit and I'm so glad I did. The material was very interesting and the workload was extremely light. It covers a broad array of topics within linguistics. If you have any interest in language or are just looking for a D2 course, take this one!",
                    "The content, which ranges from phonetics to syntax to sociolinguistics, is very interesting. However, it is delivered in a rather dull lecture format and the expectation to do well in the course is rote memorization. I gained a lot of knowledge in this course but think it could be presented in a more engaging way.",
                    "The course took a wide look at the study of language, and went over many aspects of linguistics and how linguistics is broken up as a science. It is a great introductory course.",
                    "Class is all lecture based following the PowerPoints he has on canvas. It is cool to take a Linguistics class because it's a subject area I have never learned before, but it is mostly intro stuff and a lot of common sense. Good distribution though.",
                    "This course is an overview of linguistics. presentations get a little dry, but the course is overall very manageable, and if you have the interest, enjoyable.",
                    "I thought this course was really great. I really enjoyed the material and thought the homeworks were really helpful in understanding the material.",
                    "The subject matter is well organized.",
                    "The course has a lot of information and is easy enough to keep up with. The courseload is pretty average, but the class is less enthralling than other courses.",
                    "I loved this course. Very interesting material."
                ],
                "Title": "INTRO TO STUDY OF LANGUAGE",
                "Instructor": [
                    "Manker, Jonathan"
                ],
                "Department": "Anthropology"
            },
            "002": {
                "Term": "Fall Semester 2019",
                "CRN": "(14441)",
                "Reviews": [
                    "The course was very well organized and the expectations were always clear.",
                    "Really great class, but that's partially due to the smaller classroom environment which is pretty unusual for ling 200. We got through what I think was a little more interesting material with more interaction with the topics instead of just listening to lectures for an hour. It was a little more work than the larger class but definitely definitely worth it because it still wasn't too much and we got a lot more out of it.",
                    "I liked that this class was smaller than Menker's section because it increased my ability to participate in class and made it feel like a collective learning activity instead of a lecture, which was particularly enjoyable when during the phonetics unit. We stuck to the syllabus pretty well and reading the textbook wasn't necessary until the final.",
                    "This course is very well balanced and covering all the basic and even advanced topics. It will be a great start for anyone interested in linguistics.",
                    "Great material covered!",
                    "This is an interesting course that serves well as an introduction to linguistics. There's not too much work or material to memorize. It never goes very in depth, but if you want to do so on your own time, it provides decent footholds. Also, knowing the basics of linguistics makes you a bit more of a critical thinker when it comes to everyday speech and conversation.",
                    "I love this course so much. I learned so much and it made me much more confident in choosing linguistics as a major and showed me so many possibilities for my future.",
                    "I absolutely loved this class! It made me more confident in my abilities as a Linguistics major for sure :) Jonas is one of the coolest, most dedicated professors I've had so far. He truly wants you to learn the material, and his office hours are SO helpful!",
                    "This course was so interesting and organized really well. The lectures were informative and interesting, the homeworks were applicable to class, and the exams were very clear. I enjoyed this course a lot."
                ],
                "Title": "INTRO TO STUDY OF LANGUAGE",
                "Instructor": [
                    "Wittke, Jonas B."
                ],
                "Department": "Anthropology"
            },
            "003": {
                "Term": "Spring Semester 2020",
                "CRN": "(23537)",
                "Reviews": [
                    "The course has a logical, polished organization, and Prof. Achard was always able to tie what we were learning to everything that had come before. The exams were fair in terms of their difficulty, and the weekly ungraded quizzes were a good way to gauge your own understanding of the material without much pressure. For an introduction, this course way exceptionally rich and comprehensive, and I feel that I have come away from it with a solid foundation in linguistics that is truly valuable.",
                    "Great organization!",
                    "The course material was interesting but was presented in a very average way.",
                    "This course was very interesting and all of the supporting materials are beneficial in learning the concepts.",
                    "Great course! I knew nothing about LING, but I found the class very interesting and I definitely learned a lot. A great course with great organization, would highly recommend to anyone looking for an easy and interesting DII.",
                    "The class was a fun intro to linguistics.",
                    "Easy D2 Class.",
                    "Good intro to linguistics, some parts of the course are a lot more interesting than others.",
                    "You know a class was amazing when you get emotional when it's over, and LING 200 had me all over my feels. This course offered students an introduction to linguistics with flexibility, interesting external resources, and accessible practice. I found myself barely using the textbook, relying completely on the professor's lectures and modules to get through the exams. The TED talks, articles, and websites provided allowed for a deeper understanding of linguistics, especially how the field impacts the world at large. The exams do have some questions regarding these external resources, so it is important to watch/read/use them thoroughly. Besides, they are absolutely interesting! In short, this class did not disappoint.",
                    "LING 200 was a fascinating class. I really learned a lot about language and how extraordinary it is for so many reasons. I come away from this class looking at things in a totally different light, and that's really cool. For this class, you have modules due almost every week on Friday at 5:00pm (you usually have to read a couple articles, watch a video or two, and then a short quiz). Essentially, you have to get a 70% or better on the quiz to earn the 2 points the module is worth. (These modules are all-around worth around 22% of your grade). You also have textbook readings which are very helpful for learning the material, alongside different handouts depending on the chapter. As a result, I would not push off doing the modules until Friday at 2pm, for instance. You have unlimited attempts at the modules, and you can also use them to study for the exams as well. There are 2 midterms (each noncumulative) and 1 final (cumulative); the first is worth 20% of your grade, the 2nd 25%, and the final exam 33%. This is not a blow-off class! You'll want to memorize and study things on the professor's powerpoint early, if you can. The TAs also provide midterm reviews, which is super super helpful for studying the exam! Definitely follow the reviews.",
                    "You get a lot out of the class and it isn't too demanding as long as you keep up with the lectures.",
                    "This is a really good course. It's been taught for so long that it's really polished and well put together. You start from the beginning with conversation and discourse, move through phonetics, morphology, syntax, etc. and end with sociolinguistics and other fun topics. I'd recommend this to someone in any major.",
                    "Took with Achard. Great survey of the various subfields of linguistics. I was able to identify which ones interested me most and which I might be interested in taking a deeper class on. The modules helped solidify the content without being too time consuming. I actually spent only about 4-5 days working on this class in the weeks after we got sent home by COVID-19, binge-watching lectures, doing modules, studying, and taking exams. This is not necessarily the best method for learning, but I was interested enough and the course content is well done enough that I think the material will stick. Probably not the easiest class if you have no language background/interest but you'll be ok.",
                    "This course gives a really broad overview of linguistics and covers a wide variety of topics. Modules due every week helped summarize what you would see in lectures. Lectures were pretty fast paced and really packed with information. Exams were pretty extensive and would have outside of exam data sheets that you should really do before the exam so you have enough time.",
                    "the class is well organized and makes sense as a progression through linguistics, the material is clearly presented and there are lots of resources to help you through it.",
                    "This is a good D2 class that I would recommend to anyone who is interested in languages. We covered a lot of topics, and some of them were very new and pretty hard. I put a lot of time to understand those topics, but it was totally worth it. I really liked the last chapter (language endangerment and revitalization) and the documentary We Still Live Here. The workload is average - completing modules and taking three exams (2 mid-term, 1 final).",
                    "I think Linguistics itself is a fascinating concept but the class as a whole is pretty dull. It's just too large a class for the subject, I think. There's clearly a lot of arbitration and winging-it in the field of linguistics and that level of nuance doesn't lend itself well to such a large classroom setting where students might reasonably expect more concrete and simple solutions. It's a super intriguing field but difficult to stick with due to the class's structure.",
                    "I did not enjoy the organization of this course. I think the content taught for the second midterm should have been the first concepts taught in the course. I felt like I was not given a chance to fully develop the skills I needed to succeed because of the course organization.",
                    "I LOVED this course. There are two midterms and weekly Canvas modules that get you to engage with the material while not being too difficult. The material is organized in the same order as the textbook so it's definitely worth reading.",
                    "meh",
                    "I really liked taking this course with Achard. His lectures were super engaging and that made it easier to understand the material. This class isn't too much work since there are only 2 exams and a final. I'd say if you have any experience with a foreign language, it'll help you understand some of the examples and concepts even better.",
                    "interesting intro course that covers a very wide variety of topics",
                    "idk I mean it's weekly module homework assignments and linguistics is cool, but not really my jam I guess. Still very doable as long as you properly study for the exams, which are mostly multiple choice and on Canvas",
                    "Really cool intro course that covers all the bases of introductory linguistics really well. Everything from the history of language to phonology to what language means for our human identity. I got a lot more into it than I thought it would... Im kind of a nerd for morphological analysis now. The material is just super cool and its not too much work, especially if your interested.",
                    "Ling 200 is a great class for D2. You will learn about a comprehensive picture of linguistics. The coursework is average with weekly quizzes (with unlimited attempts) and three big exams.",
                    "This class was harder than expected it to be. I enjoyed certain units and did not enjoy others. My favorite want the 1st and 3rd unit looking at the way language works within the wrold and where it came from. Personally, if it the units I did not enjoy as much if wasn't for the instructor I would have possibly dropped.",
                    "If you are interest in language at all I highly recommend this class. I was pushed to learn a lot about things I never would have considered learning on my own.",
                    "Ling 200 is a great course, you will learn a lot about language and cognition. Workload is not bad, there are readings and modules every week but they are not difficult or time-consuming and you will learn a lot from them! As a STEM major, this is a great distribution course and you will learn a lot without being overwhelmed by work.",
                    "I did not enjoy this course at all. Stay away from this course if you are taking it as a distribution requirement. The course is organized as extremely long powerpoint slides (each lecture had 60+ slides) and the instructor goes over them in very long lectures. It is an incredibly boring class with very dry material. The course is also very difficult, as you have to be really good at linguistic analysis, such as taking random words in different languages and finding patterns in them. The course requires many hours of work if you want to get an A, and it requires both memorization and practice problems (which are very difficult). This is coming from someone who got A's in all intro STEM courses so far.Unless you are passionate about linguistics, then this class is not worth the effort and boredom.",
                    "Dropped this class on the last day - never went to lecture the entire semester but my projected grade was probably an A- or B+. Really chill class - you can get an A if you put in a tiny bit of effort. Even though I dropped, it was still a really interesting class and made me more aware of different nuances in language and culture."
                ],
                "Title": "INTRO TO STUDY OF LANGUAGE",
                "Instructor": [
                    "Achard, Michel J."
                ],
                "Department": "Anthropology"
            },
            "901": {
                "Term": "Summer Semester 2020",
                "CRN": "(31998)",
                "Reviews": [
                    "I found learning linguistics to be fun and informative. It was really cool to see the patterns and processes in language that I would not have noticed otherwise.",
                    "Ling/ Anth 200 is a fantastic option for a d2 course. Interesting material that is presented in an organized and sensible way that allows for deep thinking on subjects while also being able to cater to students with little to know experience in the subject matter. Highly recommend.",
                    "I took this course as an elective, and it was so interesting! I would highly recommend it to anyone looking for an elective.",
                    "The course was extremely well-designed, covering the whole span of linguistics efficiently and in sufficient depth across only 6 weeks and purely online. The homework covered only materials that were covered explicitly in class, and was useful in reinforcing the concepts that were covered in class. The exams were also extremely fair.",
                    "It was interesting material. I wish we spent more time covering ethnic differences in English, but for an intro course, it was a good course.",
                    "I'm not majoring in linguistics, but I learned a LOT during the summer session and I had a good time doing it. I think this is a fantastic course for anyone who is interested in linguistics, history, or a related field. It was very well organized, and the resources are available and relevant.",
                    "Jonas is a great teacher. He's got charisma and a passion for the topic that's very infectious. It was really interesting to see how involved the course's content is with the world around us, and he made sure that we were able to put our personal experiences into what we were learning in the classroom, adding a personal level to the class that was greatly appreciated. The assignments were graded very quickly, as were the exams, and the course content was very straightforward. Great course, and I would love to take some more in the future.",
                    "A super fun and interesting overview of language. Would highly recommend as a D1!",
                    "Though I took an accelerated version of the course over the summer, I thought it was great introductory course. The class was well organized, the workload wasn't too heavy, and the material was really interesting. The homework assignments really contributed to my understanding of the material, and some of the assignments were actually pretty fun.",
                    "I really enjoyed learning most of the material and how language works. The course doesn't go too deep into every topic but I definitely feel like I have a solid understanding of the fundamentals. If you're looking for an easy D2 this is definitely not a bad choice.",
                    "I absolutely loved this course! The course covers the big ideas across the sub fields of linguistics, so each class was a completely new and exciting topic. I found everything we learned to be so incredibly interesting as I began to realize that I personally follow all these rules in the English language without ever realizing. Analyzing other languages to see how they do things differently was also super fascinating. I would HIGHLY HIGHLY recommend taking this class to anyone who has even a passing interest.",
                    "Great professor, interesting content. Very interactive if you want it to be. Just stay focused and do the assignments and you'd be guaranteed and A.",
                    "Loved the course and learned a lot of content in just 6 weeks, yet the course never felt rushed. Jonas cared about and engaged with us even though the course was online and over Zoom.",
                    "Easy but interesting. I feel like I learned a lot but wasn't rushed, even though the class was only 6 weeks.",
                    "I feel that I have learned a lot of new information and got a good overall introduction to linguistics.",
                    "This course was perfect for a distribution. Professor Wittke taught it in a way that was easy to understand, but it was also still interesting for non-majors. The material was well-distributed, the assignments/exams were all fair, and you can pay attention in class and take the exams without trouble."
                ],
                "Title": "INTRO TO STUDY OF LANGUAGE",
                "Instructor": [
                    "Wittke, Jonas B."
                ],
                "Department": "Anthropology"
            },
            "902": {
                "Term": "Summer Semester 2020",
                "CRN": "(31999)",
                "Reviews": [
                    "Great prof and fun material. I really feel like I can confidently discuss linguistic topics because of this. The topics covered in class were often interesting enough that I got lost researching them late into the night. Almost makes me wish I had been a LING major.",
                    "This course was very straightforward and well organized for the virtual format. The information was well presented and engaging.",
                    "This class is really interesting and the information was presented well.",
                    "This class provided a cohesive overview of the study of Linguistics, and was helpful for determining if I want to take more in-depth classes of this nature.",
                    "Subject material was really quite fascinating, and the course was effective at immersing us in it.",
                    "Dr. Wittke is pretty chill and a good prof.",
                    "This class was extremely well organized and easy to follow. The instructor was engaging and took the time to carefully explain each concept.",
                    "The course was extremely well set up for the online medium, and the material was covered well in such a way that I was able to learn and to be interested in the topic",
                    "I think the class was really well organized and the teacher was very invested in the class and helping students. The topics were also very interesting and challenging.",
                    "Very interesting intro course. Great option for distribution credit!",
                    "The homework sets are fairly straightforward, and the midterms and final are a reflection of this. I also highly recommend setting up a study group since discussing the homework and preparing for the tests definitely help. Disclaimer is that I am planning to be a linguistics major.",
                    "Enjoyable course. It was challenging but not extremely difficult, and the grading felt fair. When I got something wrong, it was because I had misunderstood something and then not taken the many opportunities to ask for clarification. Highly recommended.",
                    "Teaching was phenomenal and covered a lot of interesting topics."
                ],
                "Title": "INTRO TO STUDY OF LANGUAGE",
                "Instructor": [
                    "Wittke, Jonas B."
                ],
                "Department": "Anthropology"
            }
        },
        "202110": {
            "901": {
                "Term": "Spring Semester 2021",
                "CRN": "(23779)",
                "Reviews": [
                    "This class is interesting and the material isn't difficult to understand.",
                    "This class is definitely on the lighter side while still being very interesting. A great introduction into phonetics, morphology, semantics, sociology of language, and many other topics.",
                    "Great class",
                    "It is a well-organized, straightforward course that you can do well in if you pay attention and keep up with the assignments.",
                    "The course material was interesting and diverse, and the homework assignments were a light load but still interesting and provided a learning experience. Perfect for a non-lingustics major looking for a D2 course",
                    "This was a good intro course and covered a lot of basic information. A large range of topics are covered, some more interesting than others, but by the end, I felt like I had a good fundamental understanding of language.",
                    "Is okay. I kind of lost motivation after a while",
                    "Class content was interesting, but the lectures were fairly boring/dry. Easy A.",
                    "The homework in this class is very helpful. It helps me better understand the class materials, and also gets me better prepared for exams.",
                    "I think this course is pretty light. I enjoy learning everything about language, especially the second half of the semester when we relate linguistic to history and society.",
                    "Although I am a STEM major, I found the material of the class to be rather interesting, and the homework which was assigned was easy to manage. Additionally, no reading in the textbook needed to be done, as all of the relevant information was covered in class.",
                    "The class itself was good. The homework really helped solidify concepts, and the quizzes ensured I stayed on top of the course. While the slides were a bit boring, literally just white and black, they were still helpful for the homework and exams! The exams and grading were fair. Professor Manker is cool, but he could be a bit more engaging. Office hours weren't that helpful because I would be in the waiting room for 30 minutes, hopefully things get better when they go in person!",
                    "This course is a wonderful introduction to linguistics. Going into the course, I did not expect to enjoy the subject; however, I now hope to take more classes relating to linguistics at Rice.",
                    "The class was well organized, the quizzes basically just checked to make sure you went to class, and the exams were fair and comprehensive.",
                    "I would recommend taking this class if you're interested in linguistics and want to learn more, but not if you just need a free elective. I'm not studying linguistics and wanted an easy elective class, but it ended up being a good amount of memorizing and I found the topics pretty boring. Dr. Manker is really great though, and always makes himself available for student's questions.",
                    "I really liked the class; the topic was interesting",
                    "The material is pretty interesting, and the lectures pretty much just follow the slides so you can usually get away with just understanding those. Dr. Manker does give pop quizzes in class sometimes, though.",
                    "The class was very well structured and it was graded fairly.",
                    "This is a really great intro course! The lectures are very straightforward, and the homework clarifies important concepts that we learn in class. Professor Manker was great at explaining and clarifying concepts.",
                    "This course made me want to get a major in Linguistics. So pretty interesting, I would definitely say.",
                    "This course covered a variety of interesting topics related to linguistics without unnecessary work. The required assignments contributed to learning the material, but were not redundant. Overall, I very much enjoyed it!",
                    "The class was slightly more interesting than I expected, so if you think languages are cool than you should probably take it. Not terribly hard but you'll learn stuff",
                    "Even though the course is cross-listed with ANTH, this is really a LING class. I personally came in with the expectations that it would be more of an anthropology class, but it was still interesting to learn about aspects of linguistics that I would've never learned otherwise. There are also pop-quizzes which can also be fairly difficult if you don't keep up with material.",
                    "It's definitely a survey course; we never spent more than a week on a single topic. I thought the information was very interesting for the first half of the class when we talked about the nature of language and language analysis. Applied linguistics in the latter half was less exciting. Basically, though, attend lecture and you should be fine.",
                    "This course was a pretty comprehensive look into Linguistics as a whole, and although I would have rated it higher I am now so sensitive about the way I and others talk that I can't get it out of my head. It's like a catchy song, and it's made me question a lot. Great if you are looking to get into Linguistics, bad if you have trouble falling asleep (and you suddenly remember that you have an accent)",
                    "Easy and interesting D2 credit, I really enjoyed it. Homework every week or two, 1 midterm and final. Go to lectures and read the slides and you'll be set. Highly recommend"
                ],
                "Title": "INTRO TO STUDY OF LANGUAGE",
                "Instructor": [
                    "Manker, Jonathan"
                ],
                "Department": "Anthropology"
            },
            "904": {
                "Term": "Fall Semester 2020",
                "CRN": "(16105)",
                "Reviews": [
                    "Interesting course. Good D2. Not too much work, exams very fair, fun experience.",
                    "This is a great intro class to linguistics and I enjoyed it even though I am not a linguistics major. There were 6 homework assignments (nothing too bad), 2 midterms, and a final. Overall not too bad and Prof Wittke is super helpful/understanding. Highly recommend.",
                    "This class is super interesting and lays everything out in an easy way for beginners to follow. Lectures are engaging and none of the assignments ever feel like busy work. One of the best classes to take as a D2, cannot recommend enough.",
                    "Learned a lot about languages. Linguistics is a fascinating subject.",
                    "This course was a great introduction to the field of linguistics. However, this was not an easy course to me. The assignments in the course were weighed quite heavily and there was a lot of information to learn.",
                    "Relatively easy course but a great fun introduction to linguistics. Loved every bit of the content.",
                    "This was my favorite course! Such interesting material with a very fun and engaging professor! I definitely recommend this course for D2 requirements.",
                    "Great course! My only complaint would be that we didn't go much in depth to any one unit, which I suppose is the nature of an introductory course, but it was a little frustrating at times. And because of the condensed semester, it really felt like we rushed through certain parts of the curriculum.",
                    "Professor Wittke is a very understanding professor who does all he possibly can to make sure he develops a friendly, tight-knit classroom atmosphere. As a first-year student, I feel that he does a great job catering to the needs to all of his students, and most importantly, if you put in the effort to do well in his class, you will be sure to perform very admirably. The class isn't difficult because Professor Wittke is very generous and knowledgeable about the material he teaches, but by no means does it take anything away from the amount you get out of this course. Take this class, you will not regret it.",
                    "Super well organized, interesting and engaging class!",
                    "This course was an effective introduction to the Scientific Study of Language. The lectures were engaging and thought-provoking. They also offered plenty of examples that were important for answering questions on the homework assignments. The class was comprised of 6 Homework Assignments, 2 Mid-Term Exams, and 1 Final Exam. The material covered on all of these graded assignments were adequately covered in the lectures. Overall, this was an intriguing and compelling course delivered in an effective format.",
                    "I would recommend this class to anyone looking for an informative perspective on language. The introductory content is very interesting and the assignments accurately gauge your understanding of the content."
                ],
                "Title": "INTRO TO STUDY OF LANGUAGE",
                "Instructor": [
                    "Wittke, Jonas B."
                ],
                "Department": "Anthropology"
            }
        }
    }
}